{
    "_meta": {
        "sources": [
            {
                "json": "DarkMatterSpireSubclasses",
                "abbreviation": "DaM-SS",
                "full": "Dark Matter Spire Subclasses",
                "url": "",
                "authors": [
                    "Mage Hand Press"
                ],
                "convertedBy": [
                    ""
                ],
                "version": "1.0"
            }
        ],
        "dateAdded": 1604591775,
        "dateLastModified": 1604591775
    },
    "subclass": [
        {
            "subclassFeatures": [
                "Coalition Arcanist|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|3",
                "Coalition Blaster Gauntlet|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|3",
                "Tactical Uplink|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|7",
                "Requisition|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|10",
                "Squadsight|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|15",
                "Orbital Bombardment|Warmage|VSS|Coalition Arcanist|DarkMatterSpireSubclasses|18"
            ],
            "shortName": "Coalition Arcanist",
            "name": "Coalition Arcanist",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "page": 100
        },
        {
            "subclassFeatures": [
                "Cyberghoul|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|3",
                "Cyber Spells|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|3",
                "Construct Corpses|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|3",
                "Charnel Blaster|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|3",
                "Ghost In The Machine|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|6",
                "Digital Death|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|10",
                "Cyber Lich|Necromancer|VSS|Cyberghoul|DarkMatterSpireSubclasses|20"
            ],
            "shortName": "Cyberghoul",
            "name": "Cyberghoul",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "page": 0
        },
        {
            "subclassFeatures": [
                "Burden Of Awakening|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|1",
                "Psionic Awakening|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|1",
                "Burden Spells|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|1",
                "Bloody Reprieve|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|6",
                "Blademaster Psion|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|14",
                "Limited Foresight|Martyr|VSS|Awakening|DarkMatterSpireSubclasses|18"
            ],
            "shortName": "Awakening",
            "name": "Burden Of Awakening",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "page": 0
        },
        {
            "subclassFeatures": [
                "Decommissioner|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|3",
                "Bonus Proficiencies|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|3",
                "Trinkets|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|3",
                "Non-regulation Blaster|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|6",
                "Reprogrammer|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|10",
                "Antimagic Blaster|Investigator|VSS|Decommissioner|DarkMatterSpireSubclasses|14"
            ],
            "shortName": "Decommissioner",
            "name": "Decommissioner",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "page": 0
        }
    ],
    "subclassFeature": [
        {
            "name": "Coalition Arcanist",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Adapted to the modern scale and complexity of interstellar warfare, warmages of the Coalition blend the tactics of the College with formidable blaster technology. Squads of these arcanists form the backbone of Coalition special forces, as their firepower and discipline are unmatched, even among Coalition troops."
            ],
            "level": 3,
            "page": 100
        },
        {
            "name": "Coalition Blaster Gauntlet",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting when you choose this house at 3rd level, you gain a specialized spell focus known as a blaster gauntlet, which allows you to apply some of the traits of blasters to cantrips you cast through it. If the gauntlet is lost or stolen, you can requisition another one from the Coalition when you take a long rest.",
                "Whenever you cast a warmage cantrip that deals damage and requires a ranged spell attack using the gauntlet as a spell focus, you can apply one of the following modifiers:",
                "{@b Automatic}. You can cast a cantrip twice, targeting two different creatures within 15 feet of one another with the spell. Your spell attacks for this cantrip always have disadvantage, regardless of circumstance.",
                "{@b Scatter}. Shooting at a close range target, you increase the cantrip's damage dice by one die size for the attack. For example, if the cantrip deals d6s for damage, it deals d8s instead. If it deals d8s, it instead deals d10s, up to a maximum of d12s. This cantrip can't target a creature further than 10 feet from you.",
                "{@b Sighted}. You can cast a cantrip at up to double its range. If its target is beyond its normal range, the spell attack has disadvantage."
            ],
            "level": 3,
            "page": 100
        },
        {
            "name": "Tactical Uplink",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting at 7th level, you are fitted with a neural implant, granting you unparalleled battlefield awareness. You can use an action to gain knowledge of the general lay of the land within a 1-mile radius of yourself. This knowledge only extends to surface-level or obvious features (natural or artificial), and doesn't detect creatures of any sort.",
                "Additionally, you gain a +5 bonus to your passive Perception score."
            ],
            "level": 7,
            "page": 100
        },
        {
            "name": "Requisition",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "By 10th level, you can requisition magic items from the Coalition's armory for short term use. When you finish a long rest, choose one of the following magic items, which is teleported to you: 2 {@item attractor mine|DarkMatter|attractor mines}, a {@item dome projector|DarkMatter}, a {@item gravity nullifier|DarkMatter}, a {@item jetpack|DarkMatter}, a {@item ring of spacewalking|DarkMatter} (which is attuned to you automatically), or a {@item universal translator|DarkMatter}. This item remains in your possession for 24 hours, at which time it is teleported back to the Coalition's secure armory."
            ],
            "level": 10,
            "page": 100
        },
        {
            "name": "Squadsight",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting at 15th level, your tactical uplink synchronizes you with your allies, granting you a decisive tactical advantage. While you are within 120 feet of an ally, you know the exact location of any creature that your ally sees. Additionally, you can use a cantrip to target a creature that your ally can see, as long as that creature isn't in cover from your ally's perspective. This cantrip is fired like a mortar, ricocheted off obstacles, or fired through thin barriers to hit its target."
            ],
            "level": 15,
            "page": 100
        },
        {
            "name": "Orbital Bombardment",
            "source": "DarkMatterSpireSubclasses",
            "className": "Warmage",
            "classSource": "VSS",
            "subclassShortName": "Coalition Arcanist",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "At 18th level, you are granted access to the Coalition's vast fleet of orbital drones, which are teleported to your location. You can cast the spell {@spell orbital hardlight cannon|DarkMatter} without using a spell slot. Once you use this ability, you can't use it again until you finish a long rest."
            ],
            "level": 18,
            "page": 100
        },
        {
            "name": "Cyberghoul",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "There's more than one way to imbue a corpse with the semblance of life: while other necromancers leverage their magic for animation, you weave humming, electric wires in the dead flesh until it stirs once more. A corpse is no more than spare parts, after all. Cyberghouls eschew the traditional foundations of necromancy in favor of high technology and digital ghosts. They are hackers in every sense of the word, leveraging the bleeding edge of cybernetics to construct undead machines and dominate the technological landscape. With enough resources, such a necromancer might be able to download their brain from their body and achieve the cold, immortal life of a cyber lich."
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Cyber Spells",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "When you choose this ambition at 3rd level, you learn additional spells as noted in the table below. Each of these spells counts as a necromancer spell for you, but doesn't count against the number of necromancer spells you know. Additionally, you learn the {@spell technomancy|DarkMatter} cantrip, which is a necromancer spell for you and doesn't count against your number of cantrips known. Spell Level Spells",
                "1st {@spell flawed reconstruction|DarkMatter}, {@spell technical difficulties|DarkMatter}",
                "2nd {@spell circuit breaker|DarkMatter}, {@spell perception hack|DarkMatter}",
                "3rd {@spell greater mending|DarkMatter}, {@spell lightning bolt}",
                "4th {@spell intensify gravity|DarkMatter}, {@spell logic bomb|DarkMatter}",
                "5th {@spell simulation|DarkMatter}, {@spell wall of force}"
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Construct Corpses",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Also at 3rd level, you learn to raise the dead through blasphemous technology. When you perform your Animate Thralls ritual following a long rest, you can choose to animate any of your thralls as Constructs, causing each such thrall to have the following changes:",
                "-The thrall is a Construct instead of an Undead, but counts as an Undead for the purpose of your necromancer class features.",
                "-Any critical hit against the thrall becomes a normal hit.",
                "-The thrall gains thermalsight out to a range of 60 feet."
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Charnel Blaster",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "At 3rd level, your Charnel Touch deals damage to Constructs. Additionally, when you use your Charnel Touch and expend 5 or more points, you can coalesce your necromantic energy into an antimatter beam. Make a ranged spell attack against a target you can see within 30 feet of you instead of making a melee spell attack, dealing necrotic damage as normal on a hit."
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Ghost In The Machine",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Beginning at 6th level, you can use your bonus action to infect a piece of magical technology you can see within 120 feet with a digital spirit known as a daemon process. The daemon remains within the technology until it is removed by an antivirus or remove curse spell, or you use this ability to infect a different piece of technology. While a piece of technology is infected, you can perform any of the following operations as a bonus action while you and the target technology are on the same plane of existence:",
                "-You can cause the device to malfunction and become unusable until you use this ability to restore functionality to it.",
                "-You can attempt to hack the device. You have advantage on Intelligence (Data) checks you make to hack technology infected with your daemon process and you don't require an interface rig to do so.",
                "-You can remotely operate the device within its normal parameters. You can only perform unauthorized operations, such as opening a locked door or disabling an alarm, if you have already hacked the device.",
                "-You can instruct your daemon to act autonomously. You describe a circumstance, such as a character entering a few keystrokes of data or a certain amount of time passing, and one of the other operations detailed in this list to be performed in response. Your daemon can remember up to eight such circumstances and reactions."
            ],
            "level": 6,
            "page": 0
        },
        {
            "name": "Digital Death",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "By 10th level, you can download the necromantic spirit of your thralls into waiting corpses at the moment of death. When one of your thralls dies, you can cast the spell animate dead* as a reaction. As always, you can't reanimate Undead that have been reduced to 0 hit points."
            ],
            "level": 10,
            "page": 0
        },
        {
            "name": "Cyber Lich",
            "source": "DarkMatterSpireSubclasses",
            "className": "Necromancer",
            "classSource": "VSS",
            "subclassShortName": "Cyberghoul",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "At 20th level, you have reached the pinnacle of necromancy and transformed yourself into a lich. You have forsaken your body, digitized your soul, and transferred it into an arcane terminal, which acts as your phylactery. From this digital vantage, you stand at the forefront of technology, far beyond the frontiers of ethics that constrain your peers.",
                {
                    "type": "entries",
                    "name": "Phylactery Device.",
                    "entries": [
                        "A computing device, such as an arcane terminal, houses your soul and acts as your phylactery. You can upload your soul to a connected arcane terminal, ship computer, or datapad in an upload that you perform over the course of 10 minutes. Once your soul has left a device, it no longer bears the invulnerability typical of a phylactery. When you drop to 0 hit points, you regenerate in hardlight form within 5 feet of your phylactery device."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Hardlight Form.",
                    "entries": [
                        "You interact through the world with a hardlight avatar, a physical representation of the ones and zeros of your soul that shifts and moves as you think. You are immune to radiant damage."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Infect Construct.",
                    "entries": [
                        "As an action, your body becomes immaterial, and you attempt to infect a Large or smaller Construct you can see within 10 feet of you. This target must make a Charisma saving throw against your spell save DC. A Construct with a challenge rating greater than 10 automatically succeeds on this save.",
                        "If it fails its saving throw, you disappear and infect the Construct. While infecting the Construct, you control it. You maintain your Intelligence, Wisdom, and Charisma scores and your alignment, but otherwise use the creature's statistics. You don't gain access to the target's class features or proficiencies.",
                        "The infection lasts until the Construct drops to 0 hit points, you end the infection on your turn as a bonus action, or you are forced out by an effect like the antivirus spell. When the infection ends, your body reappears in an unoccupied space within 5 feet of the Construct.",
                        "Once you use this feature, you can't do so again until you finish a long rest."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Inhabit Technology.",
                    "entries": [
                        "You can use your action to inhabit a piece of magical technology such as an arcane terminal or datapad that you can see within 5 feet of you. You disappear and gain control over the device. While inhabiting the device, you can't be targeted by any attack, spell or other effect, and you can perform any function the device is capable of, without first hacking into it. As a bonus action, you can transfer yourself to any other piece of magical technology that is connected to the current device, or end the inhabitation. The inhabitation ends early if the device is destroyed or if you are forced out by an effect like the antivirus spell. When the inhabitation ends, you reappear within 5 feet of the inhabited device. "
                    ]
                }
            ],
            "level": 20,
            "page": 0
        },
        {
            "name": "Burden Of Awakening",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "In a moment of revelation, your mind was opened to the vast, unfathomable cosmic forces that underpin the multiverse. You could see it all: a cataclysm yawning in the future, a knot of pathways forward, and your purpose among it all. No matter the outcome, you never survive. !Ever since, a sliver of foresight has quivered in your mind, along with the spark of psionic potential. You can pull on the invisible tethers of the multiverse to move things, and you feel yourself being pulled toward destinations unknown. The ‘Verse itself has a grand design, and there's nothing you can do to escape it."
            ],
            "level": 1,
            "page": 0
        },
        {
            "name": "Psionic Awakening",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting at 1st level, your mind has been opened to vast currents of cosmic thought. You gain the following psionic abilities:",
                {
                    "type": "entries",
                    "name": "Empathy.",
                    "entries": [
                        "You can use your action to probe the surface level of a creature's emotions. You must be able to see the creature and it must be within 30 feet and have an Intelligence of 3 or higher. You learn the creature's emotional state and, at the GM's discretion, one of the creature's Bonds."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Minor Kinesis.",
                    "entries": [
                        "You learn the mage hand cantrip, and the hand is invisible when you cast the cantrip with this trait. You don't lose hit points for casting this spell. Wisdom is your spellcasting modifier for this spell."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Kinetic Shove.",
                    "entries": [
                        "You can use your bonus action to telekinetically push a creature you can see within 5 feet of you that is Large or smaller 10 feet directly away from you. Alternatively, you can use this ability to push yourself, allowing you to move 10 feet in any direction without provoking opportunity attacks.",
                        "Once you use this feature to push yourself or another creature, you can't use it again until you finish a short or long rest.",
                        ""
                    ]
                }
            ],
            "level": 1,
            "page": 0
        },
        {
            "name": "Burden Spells",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "You gain burden spells at the martyr levels listed.",
                "Martyr Level Spells Description",
                "3rd {@spell jump}, {@spell shield}",
                "5th {@spell augury}, {@spell levitate}",
                "9th {@spell counterspell}, {@spell tongues}",
                "13th {@spell divination}, {@spell stoneskin}",
                "17th {@spell telekinesis}, {@spell Rary's Telepathic Bond|telepathic bond}"
            ],
            "level": 1,
            "page": 0
        },
        {
            "name": "Bloody Reprieve",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting at 6th level, whenever you use your Torment feature against a hostile creature and you reduce the target to 0 hit points, you don't lose any hit points from using the ability."
            ],
            "level": 6,
            "page": 0
        },
        {
            "name": "Blademaster Psion",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "By 14th level, your skills in close combat border on the supernatural, a deadly union of body, mind, and blade. You gain the following abilities:",
                {
                    "type": "entries",
                    "name": "Critical Focus.",
                    "entries": [
                        "When you take the Attack action on your turn while you are within 5 feet of a hostile creature, you can use your bonus action to focus your senses on that creature for 1 minute. For the duration, your melee weapon attacks score a critical hit on a roll of 19 or 20 against this creature. You can use this bonus action up to three times, allowing your melee weapon attacks to score a critical hit on a 18–20 and then on a roll of 17–20. This benefit ends early when you score a critical hit or use this bonus action to focus on another creature."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Laser Deflection.",
                    "entries": [
                        "You can use your reaction to deflect weapon attacks against you that deal necrotic or radiant damage. When you do so, the damage you take from the attack is reduced by 1d10 plus your Wisdom modifier. If you reduce the damage to 0 and the attacker is within 5 feet of you, you can use your Sainted Reprisal against the attacker as part of the same reaction. You must be holding an antimatter dagger, laser halfsword, or laser sword to use this feature.",
                        ""
                    ]
                }
            ],
            "level": 14,
            "page": 0
        },
        {
            "name": "Limited Foresight",
            "source": "DarkMatterSpireSubclasses",
            "className": "Martyr",
            "classSource": "VSS",
            "subclassShortName": "Awakening",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "At 18th level, your expanded consciousness can perceive the future as easily as one remembers the past. Whenever you start your turn, you can choose to be under the effects of the {@spell foresight} spell for 1 round. You can use this feature to gain the spell's effects for up to 1 minute—a total of 10 rounds—all at once or in several shorter bursts, each using a minimum of 1 round from the duration. You regain this spell's duration when you finish a long rest. "
            ],
            "level": 18,
            "page": 0
        },
        {
            "name": "Decommissioner",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Blaster in hand and badge in pocket, your job is to hunt down renegade androids—especially the troublesome Version 13 units—that prowl through human megacities wearing perfect human facades. Your best tools are reliable detection, high firepower, and a knack for unpicking mysteries, w↣hich has made you a foremost expert in killing constructs of all stripes. Whenever an N-Virus outbreak threatens a world, a few decommissioners are pulled from their gumshoe duties to stem the tide and take down the most lethal units in the wave. And whenever a rogue AI gets its virtual hands on a superweapon, your datapad starts to buzz."
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Bonus Proficiencies",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting when you choose this specialization at 3rd level, you gain proficiency in Data and one of the following skills of your choice: Insight, Investigation, or Technology. "
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Trinkets",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "By 3rd level, you've collected a number of technological trinkets to aid you in the detection and elimination of rogue constructs. You can use the following trinkets:",
                {
                    "type": "entries",
                    "name": "Biodynamic Quadcorder.",
                    "entries": [
                        "As a bonus action, you can direct this device at a creature you can see within 30 feet of you. You learn the creature's type and the damage resistances it possesses, if any."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Electric Sheep Generator.",
                    "entries": [
                        "As a bonus action, you can cast the spell {@spell technical difficulties|DarkMatter} once without expending a spell slot or spell components. When you cast the spell using this trinket, you can attempt to target a creature with it. If the creature is a Construct, it must make a Wisdom saving throw against your spell save DC or be stunned until the start of your next turn, even if it would otherwise be immune to being stunned. A creature with a challenge rating greater than your investigator level automatically succeeds on this save."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Interrogation Field.",
                    "entries": [
                        "You can cast the spell {@spell zone of truth} once without expending a spell slot. When you cast the spell using this trinket, each Construct in the area makes its saving throw with disadvantage. "
                    ]
                }
            ],
            "level": 3,
            "page": 0
        },
        {
            "name": "Non-regulation Blaster",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "Starting at 6th level, you can spend 10 minutes modifying a blaster with aftermarket components to improve its stopping power. This blaster remains improved until you use this ability to modify a different blaster. Whenever you roll the highest number possible on one of the blaster's damage dice, you can roll that die again and add its damage to the total, rolling again if this number is also the highest, and so on. You can roll a total of 6 damage dice for the damage roll, or 12 on a critical hit."
            ],
            "level": 6,
            "page": 0
        },
        {
            "name": "Reprogrammer",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "By 10th level, you are an expert in cracking secure systems, ranging from arcane terminals to hard-coded automatons. You can make an Intelligence (Data) check to hack a system as an action rather than over the course of a minute.",
                "Furthermore, you can use your action to hack a Construct within 5 feet of you. The Construct makes a Wisdom check opposed by your Intelligence (Data) check. A Construct with a challenge rating greater than your investigator level automatically succeeds on this save. If it fails, you can perform one of the following operations:",
                {
                    "type": "entries",
                    "name": "Learn Directives.",
                    "entries": [
                        "You learn the explicit instructions given to a simple Construct, such as an automaton, or the surface thoughts of an advanced Construct, such as an artificial intelligence. You also learn if the Construct is infected with the N-Virus or if its programming is otherwise corrupted."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Override Directives.",
                    "entries": [
                        "You can modify the explicit instructions given to a simple Construct, such as an automaton, causing it to abandon its current objective, become indifferent to one or more creatures, or to pursue a simple directive of your choosing. The GM decides if a construct is too sophisticated to override or if a directive is too complex for a construct to follow."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Sleep Mode.",
                    "entries": [
                        "The Construct drops into a low-power mode and falls unconscious, even if it would otherwise be unable to fall asleep. This effect ends if the Construct takes damage or at the end of its next turn."
                    ]
                },
                "Once you perform this operation on a Construct, you can't use it again on that Construct again for 24 hours."
            ],
            "level": 10,
            "page": 0
        },
        {
            "name": "Antimagic Blaster",
            "source": "DarkMatterSpireSubclasses",
            "className": "Investigator",
            "classSource": "VSS",
            "subclassShortName": "Decommissioner",
            "subclassSource": "DarkMatterSpireSubclasses",
            "entries": [
                "At 14th level, your modified blasters can rip localized holes in the fabric of magic, disrupting spellcasters and constructs on impact. Whenever you use your Exploit Weakness with your modified blaster and hit a target, you can create a temporary 5-foot diameter sphere of antimagic, centered on the target, as per the spell antimagic field. This field also disrupts magical technology, such as blasters.",
                "When a Construct enters the affected area for the first time on a turn or starts its turn there, it must make a Wisdom saving throw against your spell save DC or be stunned until the start of your next turn, even if it would otherwise be immune to being stunned. The field lasts until the start of your next turn.",
                "Once you use this ability, you can't use it again until you finish a short or long rest. "
            ],
            "level": 14,
            "page": 0
        }
    ],
    "optionalfeature": [
        {
            "name": "Leading Edge Tactics",
            "source": "DarkMatterSpireSubclasses",
            "entries": [
                "{@i Prerequisite: 2nd Level, Coalition Warmage}",
                "You always have a plan when engaging the enemy. As such, attacks during the first round of combat have disadvantage against you."
            ],
            "featureType": [
                "T:WM"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 2,
                        "class": {
                            "name": "Warmage"
                        },
                        "subclass": {
                            "name": "Coalition",
                            "visible": true
                        }
                    }
                }
            ]
        },
        {
            "name": "Technomancer",
            "source": "DarkMatterSpireSubclasses",
            "entries": [
                "{@i Prerequisite: Technomancy Cantrip}",
                "Your constant exposure to magical technology has given you the ability to manipulate it almost subconsciously. You can cast the cantrip {@spell technomancy|DarkMatter} as a bonus action on your turn, and can do so without using somatic components. Additionally, you can use the cantrip to attempt to hack devices within range."
            ],
            "featureType": [
                "T:WM"
            ],
            "prerequisite": [
                {
                    "spell": [
                        "technomancy|DarkMatter#c"
                    ]
                }
            ]
        },
        {
            "name": "Gauntlet Upgrade",
            "source": "DarkMatterSpireSubclasses",
            "entries": [
                "{@i Prerequisite: 10th Level, Coalition Warmage}",
                "You install a high-power module in your blaster gauntlet. You can apply one of the following two modifiers to cantrips that you cast using your Coalition Blaster Gauntlet ability.",
                "{@b Beam.} The cantrip creates a 5-foot wide beam out to the spell's range in a direction you choose. This beam lasts until the start of your next turn. When a creature enters the area for the first time on a turn or starts its turn there, it must succeed on a Dexterity saving throw against your spell save DC or take the spell's damage.",
                "{@b Overheat.} The cantrip's damage dice become d12s.",
                "Once you use one of these modifiers, you can't use them again until you finish a short or long rest."
            ],
            "featureType": [
                "T:WM"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 10,
                        "class": {
                            "name": "Warmage"
                        },
                        "subclass": {
                            "name": "Coalition",
                            "visible": true
                        }
                    }
                }
            ]
        }
    ]
}