{
    "_meta": {
        "sources": [
            {
                "json": "HWKS",
                "abbreviation": "HWKS",
                "full": "Humblewood Kickstarter Content",
                "authors": [
                    "Hit Point Press"
                ],
                "convertedBy": [
                    "Shin"
                ],
                "color": "CCAA00",
                "url": "",
                "version": "1.0"
            }
        ],
        "dateAdded": 1611775108,
        "dateLastModified": 1611775108
    },
    "spell": [
        {
            "name": "Mend Plants",
            "source": "HWKS",
            "page": 0,
            "level": 0,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 30
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "a small twig and a loop of twine"
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "Drawing on primordial magic, you can instill vitality in nearby plants to create one of the following effects within range:",
                {
                    "type": "list",
                    "items": [
                        "You instantly repair a single break or tear in a living plant you touch, such as torn foliage, a scorched branch, a scar cut into bark, or two pieces of a plant that have been broken apart. As long as the damage is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former destruction.",
                        "You instantly cause a defoliated plant to grow foliage, cause a planted seed to sprout, or restore the ability to sprout to a dead seed pod.",
                        "You can cause a 5-foot cube of living plants to flourish with foliage such as leaves and grass. This area can become thick enough to conceal a Medium or smaller creature, or become overgrown enough to become difficult terrain (your choice when you cast the spell).",
                        "You can touch a living plant with 10 or fewer hit points remaining to stimulate regenerative growth.The plant regains 1 hit point at the start of each of its turns for the next minute."
                    ]
                }
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            },
            "miscTags": [
                "HL"
            ]
        },
        {
            "name": "Aether Aquatica",
            "source": "HWKS",
            "page": 0,
            "level": 4,
            "school": "C",
            "time": [
                {
                    "number": 10,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 30
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "A gold statuette of a fish worth 20 gp, which the spell consumes, and a large body of water.",
                    "cost": 2000,
                    "consume": true
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 24
                    }
                }
            ],
            "entries": [
                "From the depths of the water, you conjure a massive but gentle elemental to transport you across the waves. The conjured elemental is a Huge creature made of shimmering water, and it takes the shape of an aquatic creature of your choice. It has an AC of 19, 150 hit points, and a damage threshold of 20. It is immune to acid, poison, and psychic damage. The elemental has a swimming speed of 80 feet and cannot make attacks, though you can command it to take other actions on your turn.g",
                "At your command, the elemental's mouth opens, creating a portal to an extradimensional space inside of it. You and up to nine other creatures of Medium size or smaller can fit in this space, which contains a common room, a cargo hold capable of storing 30 cubic feet of cargo, and quarters for yourself and your guests. The interior is fully furnished, and you can alter the number of quarters as well as the look of each area by spending 1 minute focusing on the desired change. The common room contains an oval window that shows the elemental's field of view. While you are inside the common room, you can direct the elemental to take actions.",
                "When the spell ends, or if the elemental is reduced to 0 hit points, it slowly begins to disintegrate into tiny bubbles over the next {@dice 1d10} minutes. Once it has disappeared, creatures and objects not created by the spell are flung into random spaces within 5 feet of where the elemental used to be. If the elemental has 1 or more hit points remaining, you can extend the duration by casting the spell again."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Aether Figment",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "C",
            "time": [
                {
                    "number": 10,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "An arcane focus or magical object worth at least 10 gp.",
                    "cost": 1000
                }
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "You use an arcane focus or magical item in your possession to call forth a pale figment. The translucent figment has the stats of a CR 0 beast of your choice (chosen the first time you cast this spell on the object) but has the construct creature type. The figment takes on the form of the chosen creature while the used object floats at the core of the figment. The figment gains access to any traits or properties possessed by the item, has an Intelligence score of 10, and can speak any languages you know.",
                "The construct is sentient and obeys your commands to the best of its ability. As an action, you can command the figment to revert to being an item or to turn back into a creature. While in its item form the figment can still see and hear as normal and can communicate with you telepathically out to a range of 60 feet. If the figment is reduced to 0 hit points, roll a {@dice d20}. On a result of 10 or lower, the item it was created from is destroyed. Magical items of rare or higher rarity have advantage on this roll.",
                "You can only have one figment at a time. If you cast this spell while you already have a figment, you must choose which one to keep."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Bad Berry",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A food item."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 6
                    }
                }
            ],
            "entries": [
                "You weave an insidious curse into a single piece of food. The foodstuff becomes far more appetizing to the senses: loaves and pies plump and exude an inviting aroma, apples become brightly colored and have a noticeable shine, and thin stews become meals fit for a king. Yet, however appealing the food may seem, it tastes of ash.",
                "A creature that has even the smallest bite of the cursed food must make a Constitution saving throw, taking {@damage 4d8} necrotic damage and becoming {@condition poisoned} on a failure or taking half as much damage on a success. The {@condition poisoned} effect lasts for 12 hours."
            ],
            "damageInflict": [
                "necrotic"
            ],
            "savingThrow": [
                "constitution"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Briar Bastion",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 60
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A single rose."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "A defensive hedgerow of thorny rose-briar springs forth from the ground. You can choose to have the barrier form a wall up to 30 feet long and 5 feet tall, or a circle that is 15 feet in diameter and 10 feet tall. In either formation, the vegetation is 5 feet thick, providing three-quarters cover, and creatures on both sides of it are heavily obscured. A creature that enters the briar for the first time on its turn or starts its turn inside must make a Dexterity saving throw. On a failure, it takes {@damage 3d4} piercing damage and its speed is reduced to 0 until the start of its next turn."
            ],
            "damageInflict": [
                "piercing"
            ],
            "savingThrow": [
                "dexterity"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Burrow",
            "source": "HWKS",
            "page": 0,
            "level": 5,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 80
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A small stone carving depicting a claw or a shovel."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 24
                    }
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "You conjure a 5-foot-wide hole in a solid surface within range. The hole appears to lead to an endless dark tunnel. While casting the spell, choose any number of creatures that you can see. When you or a chosen creature enters the hole, you or the creature is instantly teleported to a cozy den. Other creatures that enter the hole are immediately turned around and forced to exit it. Any spell, effect, or object that enters the hole cannot reach the den unless you allow it.",
                "The den is an extradimensional space that resembles an underground burrow and is large enough to accomodate you and ten other Medium or smaller creatures. The atmosphere inside the den is always comfortable and dry. Until the spell ends, you can command the interior to become dimly lit or dark. A 5-foot-wide porthole in the den shows you the area outside the hole and can be used to exit the space. You cannot cast spells or attack through this opening.",
                "Subsequent castings of this spell do not end the first effect, and these holes become new entrances to the den created by your first casting of this spell. Any creatures still inside the den when the spell ends appear outside the den in an unoccupied space within 20 feet of the entrance to the den."
            ],
            "miscTags": [
                "SGT",
                "TP"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Cairith's Corral",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "V",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Shout a challenge and make a melee spell attack against a hostile creature that is Large or smaller. On a success, you summon a spectral spherical cage that traps both you and the hostile creature inside. The cage is 30 feet wide and 20 feet tall, and is an immobile, solid barrier that prevents matter from passing through it. It can be magically dispelled or suppressed (as if under the effects of the antimagic field spell). Creatures only partially within the perimeter of the cage and those too large to fit inside the cage are pushed away from the cage until they are completely outside it.",
                "A creature inside the cage can't leave it by nonmagical means. The spell ends once you or the hostile creature are reduced to 0 hit points."
            ],
            "spellAttack": [
                "M"
            ],
            "miscTags": [
                "SMN"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Concussive Launch",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "line",
                "distance": {
                    "type": "feet",
                    "amount": 60
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "Your flesh hardens as jets of flame from your feet propel you with tremendous velocity. You rocket forward 60 feet in a direction of your choice without provoking attacks of opportunity. Each creature in your path must make a Strength saving throw. On a failed save, a creature takes {@damage 4d8} bludgeoning damage and is knocked {@condition prone}. On a successful save, a creature takes half as much damage and remains standing. Unsecured objects in your path take {@damage 4d10} bludgeoning damage, ignoring damage thresholds. If you deal damage to a creature or object in this way, you become {@condition incapacitated} until the end of your next turn. The spell discharges a concussive boom audible out to 300 feet."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 3rd level or higher, you increase the bludgeoning damage dealt to creatures by {@dice 1d8}, and the bludgeoning damage dealt to objects by {@dice 1d10}, for each slot level above 2nd."
                    ]
                }
            ],
            "damageInflict": [
                "bludgeoning"
            ],
            "conditionInflict": [
                "prone"
            ],
            "savingThrow": [
                "strength"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Cymatic Sight",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A small ceramic plate and a lock of horse hair."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You amplify your connection to the energies of the earth, granting you the ability to detect movement through vibrations. For the duration of the spell, you have {@sense tremorsense} out to a range of 60 feet.",
                "The {@sense tremorsense} allows you to detect and pinpoint the origin of vibrations within range, provided that you and the source of the vibrations are in contact with the same solid or liquid (for example, ground or water). Tremorsense can only be used to detect vibrations from a source that is in direct contact with the same solid or liquids you are in contact with. The {@sense tremorsense} cannot be used to detect flying creatures."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "CLeric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Eat Rocks",
            "source": "HWKS",
            "page": 0,
            "level": 0,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 90
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "With a mighty shout, you conjure a collection of stones to pummel and distract your foe. One target within range must succeed on a Constitution saving throw or take {@damage 1d8} bludgeoning damage. Additionally, the next attack made against the target before the start of your next turn is made with advantage.",
                "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), an{@dice d17}th level ({@dice 4d8})."
            ],
            "scalingLevelDice": {
                "label": "bludgeoning damage",
                "scaling": {
                    "1": "1d8",
                    "5": "2d8",
                    "11": "3d8",
                    "17": "4d8"
                }
            },
            "damageInflict": [
                "bludgeoning"
            ],
            "savingThrow": [
                "constitution"
            ],
            "miscTags": [
                "SCL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Elastic Tongue",
            "source": "HWKS",
            "page": 0,
            "level": 0,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 20
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "As you finish casting the spell, your tongue grows long and sticky like a toad's, shooting out from your mouth and targeting an object within range. The sticky tongue latches onto the object and pulls it to you.",
                "If you have free hands, you can immediately wield the object; otherwise, it drops at your feet. If the object is being held or carried by a creature, the creature must succeed on a Strength saving throw against your spell save DC to maintain its grip on the object.",
                "If you target an object that is too heavy to move, like a wall or a large rock, you are instead pulled toward the object, provoking opportunity attacks as normal."
            ],
            "savingThrow": [
                "strength"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Enthrall Plant",
            "source": "HWKS",
            "page": 0,
            "level": 6,
            "school": "N",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 10
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "An obsidian amulet worth at least 500 gp, anointed with fresh animal blood.",
                    "cost": 50000
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 10
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "Imbuing a Large or smaller mundane plant with tendrils of shadowy magic, you take control of it, causing it to grow unnaturally and uproot into a sentient, mobile servant tied to your life force. For the duration of the spell, the plant's bark or leaves ripple with dark energy and it becomes a lumbering construct with the statistics of a shield guardian.",
                "You have a telepathic link to your creation while you are on the same plane of existence. You can use this telepathic link to issue commands to your construct while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"{@action Attack} that creature,\" \"Run over there,\" or \"Fetch that object.\" If the plant completes the order and receives no further direction from you, it defends and preserves itself to the best of its ability.",
                "As an action, you can take total and precise control of the plant. Until the end of your next turn, the plant takes only the actions you choose and doesn't do anything that you don't allow it to do. During this time, you can also cause it to take a reaction, but this requires you to expend your own reaction."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 7th level, you can concentrate on it for up to 1 hour. When you use a spell slot of 8th level, you can concentrate on it for up to 8 hours. When you use a spell slot of 9th level or higher, the spell no longer requires concentration."
                    ]
                }
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Entomb",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 90
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A handful of wet mud."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "The ground beneath an enemy softens to a mud-like consistency and begins to engulf and crush them. Choose one creature you can see within range. The target must succeed on a Strength saving throw or be {@condition restrained} and take {@damage 2d8} bludgeoning damage at the start of each of its turns. A {@condition restrained} creature can attempt a new saving throw at the end of its turn, ending the effect on a success.",
                "This spell has no effect on a creature that is not touching the ground."
            ],
            "damageInflict": [
                "bludgeoning"
            ],
            "conditionInflict": [
                "restrained"
            ],
            "savingThrow": [
                "strength"
            ],
            "miscTags": [
                "SGT"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Etheral Claws",
            "source": "HWKS",
            "page": 0,
            "level": 0,
            "school": "V",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "s": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "Jagged, spectral claws surround your hands and feet, allowing you to attack with the ferocity of a beast. Make a melee spell attack against a creature you can reach. On a hit, the target takes {@damage 1d8} slashing damage. If the attack roll scores a critical hit, the target takes an additional 5 slashing damage. After you make the attack, the spectral claws dissipate.",
                "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), and 17th level ({@dice 4d8})."
            ],
            "scalingLevelDice": {
                "label": "slashing damage",
                "scaling": {
                    "1": "1d8",
                    "5": "2d8",
                    "11": "3d8",
                    "17": "4d8"
                }
            },
            "damageInflict": [
                "slashing"
            ],
            "spellAttack": [
                "M"
            ],
            "miscTags": [
                "SCL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Fall Apart",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "N",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A quill and some ink"
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 24
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "Using a quill, you draw a dotted line around a part of your body. This body part separates from you once you finish casting the spell. How you choose to separate your body is up to you. For example, you could make a dotted line around your waist to bisect yourself into a top half and a bottom half, or you could trace the dotted line around your eye, ear, or mouth to separate it from your face. The separation deals no damage and leaves no wound. If you occupy the same space as your detached body part, you can reattach it as an action.",
                "You receive sensory information from your body part and can control it so long as you are on the same plane. Body parts that possess the ability to propel themselves (such as a hand that can skitter around on its fingers) can move up to half of your speed each turn, reducing your own movement speed by an amount equal to the distance the part travels. As a bonus action, you can take an action with your body part. The type of action is restricted by how you chose to separate yourself. For example, an eye can't speak, and a separated hand can't cast spells.",
                "Your body part uses your armor class, and any damage dealt to it is transferred to you. Once the spell ends, or once your body part takes damage, it immediately dissipates in a ghostly wisp and appears reattached to you."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 3rd level or higher, you can separate an additional body part from yourself for each slot level above 2nd."
                    ]
                }
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Fillian's Wind Dance",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "V",
            "time": [
                {
                    "number": 1,
                    "unit": "bonus"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "s": true
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You begin a magical dance that harnesses the power of the wind. You must continue the dance to maintain concentration on the spell, which requires moving at least 5 feet each round after you cast it. While under the effect of the spell, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your movement speed increases by 10 feet.",
                        "Your movement doesn't provoke attacks of opportunity.",
                        "Ranged attacks against you are made with disadvantage.",
                        "For the spell's duration, your strikes are accompanied by strong gusts of wind. Once on each of your turns when you make a successful melee attack against a hostile creature, they must also succeed on a Strength saving throw or be pushed back 10 feet."
                    ]
                }
            ],
            "savingThrow": [
                "strength"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Glinteye",
            "source": "HWKS",
            "page": 0,
            "level": 1,
            "school": "D",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "radius",
                "distance": {
                    "type": "feet",
                    "amount": 30
                }
            },
            "components": {
                "m": {
                    "text": "A fine quartz crystal worth at least 100 gp.",
                    "cost": 10000
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Holding the crystal up to your eyeline and looking through it, you perceive the true value of objects. For the duration of the spell, you can instantly determine the following information about any object you can see within 30 feet of you:",
                "The object's approximate worth in gp, and a fair market price for the object (if any)",
                "Whether or not the object possesses a magical aura",
                "Any historical or scholarly significance possessed by the object",
                "Whether or not the object was stolen within the last 10 days"
            ],
            "miscTags": [
                "SGT"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Guiding Stars",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "D",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 60
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "Small floating stars appear, marking the safest pathway out of an area (if one exists). They twinkle brightest the moment before danger emerges, preventing you from being surprised during combat for the spell's duration.",
                "You can end the spell early as a bonus action. When you do, you can grant yourself or an allied creature within range advantage on its next ability check, attack roll, or saving throw."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Haunting Echo",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "I",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 60
                }
            },
            "components": {
                "v": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "You hurl a disparaging insult at a creature within range that barrages its mind. The target must make a Wisdom saving throw, taking {@damage 4d8} psychic damage on a failed saving throw or half as much on a successful one. On a failed save the insult echoes, also causing the creature to be {@condition deafened} and react oddly.",
                "At the start of the creature's next turn, roll a {@dice d4} and consult the table below to see how the creature reacts.",
                {
                    "type": "table",
                    "colLabels": [
                        "d4",
                        "Effect"
                    ],
                    "colStyles": [
                        "col-1 text-center",
                        "col-5"
                    ],
                    "rows": [
                        [
                            "1",
                            "The creature drops anything it is holding and crumples to its knees, clutching its head. The creature canâ€™t move or take actions this turn."
                        ],
                        [
                            "2-3",
                            "The creature is shaken and has disadvantage on attack rolls, ability checks, and saving throws until the start of its next turn."
                        ],
                        [
                            "4",
                            "The creature lashes out, using its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature instead attacks the nearest object."
                        ]
                    ]
                }
            ],
            "damageInflict": [
                "psychic"
            ],
            "conditionInflict": [
                "deafened"
            ],
            "savingThrow": [
                "wisdom"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Healing Haze",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 60
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A drop of water and a puff of air."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "A cloud of silvery mist materializes in a 10-footradius sphere within range, obscuring everything within it. As a bonus action on your turn, you can move the cloud up to 30 feet in any direction. While concentrating on the spell, you can use an action to have the cloud sprinkle a gentle drizzle of rainfall down on anything within the fog. Each creature caught in the rain regains hit points equal to {@dice 1d6} + your spellcasting ability modifier."
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Hearth & Home",
            "source": "HWKS",
            "page": 0,
            "level": 1,
            "school": "C",
            "time": [
                {
                    "number": 10,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 5
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "A small flintstone and a pile of tinder, which the spell consumes.",
                    "consume": true
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 24
                    }
                }
            ],
            "entries": [
                "You conjure a small flagstone hearth in a space within 5 feet of you. The hearth is lit with a magical flame that emits bright light in a 20-foot radius, dim light for an additional 20 feet, and tangible warmth. For the duration, you can light or extinguish this flame as an action, but otherwise, the hearth remains lit until dispelled.",
                "While the hearth is lit, you can sense where it is in your mind and know the shortest (though not the safest) path to reach it. If you move farther than 1 mile from the conjured hearth or cast this spell again, the hearth disappears and the spell ends."
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Isolate",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "I",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 30
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You cause a creature within range to take on a form that reflects its innermost evil. The target must succeed on a Wisdom saving throw or assume an unsettling, monstrous appearance for the duration. While transformed, the creature is plagued with dread and takes {@damage 1d8} psychic damage at the start of each of its turns. A creature reduced to 0 hit points by the psychic damage falls {@condition unconscious} but is stable.",
                "This spell causes allies of the affected creature to be repulsed by the sight of them. Until the spell ends, any creature who attempts to heal the affected creature, target the affected creature with a beneficial spell, or render other forms of aid to the affected creature must succeed on a Wisdom saving throw. On a failed save, the creature rendering aid to the affected creature must choose a new target for the spell or effect, or the spell or effect fails.",
                "This spell doesn't prevent the affected creature from benefiting from area effects, such as standing inside a magic circle. If the affected creature honestly surrenders, allows itself to be captured, or performs a selfless act on another's behalf, the isolate spell immediately ends.",
                "This spell has no effect on a creature that is immune to psychic damage."
            ],
            "damageInflict": [
                "psychic"
            ],
            "savingThrow": [
                "wisdom"
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Khaluz's Blessing",
            "source": "HWKS",
            "page": 0,
            "level": 1,
            "school": "V",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "m": "A melee weapon."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "minute",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You chant a holy phrase as the weapon in your hand begins to glow. You can channel this light into burning rays that scorch your enemies. The weapon radiates bright light in a 30-foot radius and dim light for an additional 30 feet.",
                "When you cast this spell, you use the weapon's light to make a ranged spell attack against a creature you can see within 60 feet. On a hit, the target takes {@damage 1d8} radiant damage. Once per turn and while concentrating on the spell, as an action you can repeat the attack. If a feature (like Extra {@action Attack}) grants you one or more additional attacks when you take the {@action Attack} action, you can only use one of your attacks to launch the burning rays. You use your additional attacks normally."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for every two slot levels above 1st."
                    ]
                }
            ],
            "damageInflict": [
                "radiant"
            ],
            "spellAttack": [
                "R"
            ],
            "miscTags": [
                "SGT"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Cleric",
                        "source": "PHB"
                    },
                    {
                        "name": "Paladin",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Kiss of Witch Hazel",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "E",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 30
                }
            },
            "components": {
                "v": true,
                "m": "A fragrant flower."
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "Your kind words are infused with the power of the fabled mage witch, Hazel. A breeze carries your murmurs to an allied creature, enveloping it in a soothing fragrance that bolsters its vital energies. A target within range regains hit points equal to {@dice 1d6} + your spellcasting ability modifier. If the allied creature is {@condition blinded}, {@condition deafened}, or {@condition poisoned}, it can immediately repeat its saving throw against the effect, ending it on a success.",
                "This spell has no effect on constructs or undead."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 3rd level or higher, the target heals an extra {@dice 1d6} hit points for every slot level above 2nd."
                    ]
                }
            ],
            "conditionInflict": [
                "blinded",
                "deafened",
                "poisoned"
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Metabolise",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "self"
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You transform your body into the ultimate devourer, capable of eating and gaining nourishment from almost anything. While active, your bite can cut or crush any nonmagical object. Furthermore, if you eat anything that is harmful (such as poison or lava) you have resistance to any damage the substance or object would deal and advantage on saving throws to resist harmful effects caused by what you eat.",
                "As an action, you can consume 5 cubic feet worth of material within your reach, destroying the material to regain hit points equal to {@dice 1d10} + your spellcasting ability modifier."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 5th level or higher, you can consume an additional 5 cubic feet worth of material and regain an additional {@dice 1d10} hit points per action for every two slot levels above 3rd."
                    ]
                }
            ],
            "miscTags": [
                "HL"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Mind Marble",
            "source": "HWKS",
            "page": 0,
            "level": 6,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "This spell allows you to manage thoughts and memories in the form of pea-sized spheres. These spheres, called mind marbles, can be carried and are nearly weightless. A sphere can be destroyed by an effect that dispels or suppresses a 6th level spell, but it is otherwise indestructible. This spell can be used in one of two ways, chosen when you cast the spell. If either version of the spell is cast on an unwilling target, the creature can resist with a successful Wisdom saving throw. The creature makes this saving throw with advantage if it is hostile or distrustful toward you.",
                {
                    "type": "entries",
                    "name": "Pluck",
                    "entries": [
                        "You can touch a creature (including yourself) to remove its thoughts and store them in a mind marble. When casting the spell, you choose some knowledge, skill, or memory to take from the target. This can be as simple as \"skill with longswords\" or as complex as \"the night of the autumn ball, from dusk to dawn.\" Whatever information you take is removed from the creature's thoughts. If knowledge was taken, the creature forgets it, but if a specific memory was taken, the creature is aware of the memory's absence despite being unable to recall it. Class features and information that a creature needs to survive (like knowing how to walk or breathe) can't be plucked."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Plant",
                    "entries": [
                        "You can plant a mind marble you possess into your mind or the mind of another creature within range by pressing the orb into the creature's body. Once planted, the mind marble dissipates and the thoughts it contains take root within the mind of the target. Skills and knowledge are transferred seamlessly. Any memories planted in a creature's mind can be experienced from a first-person perspective by spending 10 minutes in quiet meditation. A creature always knows the difference between a memory that has been planted and its own."
                    ]
                }
            ],
            "savingThrow": [
                "wisdom"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Nature's Guide",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "E",
            "time": [
                {
                    "number": 1,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "miles",
                    "amount": 1
                }
            },
            "components": {
                "v": true,
                "m": "A musical instrument and a morsel of food."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 8
                    }
                }
            ],
            "entries": [
                "You play an alluring song, beckoning a nearby beast or monstrosity. By offering the beckoned creature the morsel of food, it agrees to serve as your guide. The type of creature is chosen by the GM based on your location. The creature is considered {@condition charmed} for the duration of the spell, but the spell ends if combat begins or if the creature takes damage.",
                "You and the {@condition charmed} creature have an empathic link through which you can share simple concepts and emotions. The creature imparts its knowledge of the terrain to you and can lead you toward another creature, object, or place that you seek so long as the creature is familiar with it. The creature also leads you along paths that avoid places or creatures that it recognizes as dangerous. For example, if the creature is hunted, it avoids its predators. The creature cannot be surprised while the spell is active and informs you whenever it senses a hostile creature or situation.",
                "You can end the spell as an action, at which point the {@condition charmed} condition ends and the creature leaves. If the spell is ended by combat or by damage dealt to the creature, there is a 50 percent chance it becomes hostile toward you and attacks."
            ],
            "conditionInflict": [
                "charmed"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Bard",
                        "source": "PHB"
                    },
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Nettle's Needlework",
            "source": "HWKS",
            "page": 0,
            "level": 2,
            "school": "T",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "A pair of scissors, fine thread, and a silver sewing needle worth at least 50 gp.",
                    "cost": 5000
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 1
                    }
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "You can cut apart or stitch together an object of your choice. Choose one when you cast this spell.",
                {
                    "type": "entries",
                    "name": "Cut",
                    "entries": [
                        "You can make a surgical cut up to 20 feet long and no more than 5 feet deep into a surface or freestanding object. For the duration, the surrounding surface becomes pliable like fabric and can be pulled open as wide as 5 feet. The cut can be used by creatures to pass through the object or be used to conceal themselves inside of the object (if the interior dimensions of the object allow). When not pulled open, the cut can't be detected by the naked eye, although anyone investigating the area can discover the cut with an Intelligence ({@skill Investigation}) check against your spell save DC. Alternatively, you can make a single, continuous cut through a nonmagical object less than 5 feet wide to slice it into separate parts. If the two parts are not rejoined before the spell ends, the cut becomes permanent."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Stitch",
                    "entries": [
                        "You use your needle and thread to magically sew two objects together so long as the two connected objects do not exceed a volume of 125 cubic feet. This can be used to simply mend a broken object or to seal an entrance by sewing a door to its frame. Once you finish your needlework, the threads disappear, and the objects fuse together at the seam for the duration."
                    ]
                }
            ],
            "miscTags": [
                "PRM"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Warlock",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Rekindle",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "N",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "touch"
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A piece of charcoal made from animal bone."
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 1
                    },
                    "concentration": true
                }
            ],
            "entries": [
                "You touch a corpse, immolating it to give its memories form. A fiery spirit assumes the appearance of the deceased creature and plays out the actions it took in life. For the spell to work, the corpse can't be undead and must be mostly intact.",
                "The spirit uses the stat block for a fire elemental. When you cast this spell, you immediately know how long the creature lived. As you are concentrating on the spell, you can influence the spirit to act out any event from its life. The spirit peacefully reenacts the movements of the deceased without moving from the spot where the corpse was. With a dry and raspy voice that sounds like crackling tinder, it repeats the same words it spoke in life.",
                "You can choose to end the spell and disperse the spirit as an action, but if your concentration is broken or the spirit takes damage at any point, the spirit doesn't disappear. Instead, you lose control of the spirit, it becomes hostile toward all creatures within sight, and it might attack. An uncontrolled spirit can't be dismissed by you, and it disappears 1 hour after you summoned it."
            ],
            "miscTags": [
                "SMN"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Tangled Growth",
            "source": "HWKS",
            "page": 0,
            "level": 3,
            "school": "A",
            "time": [
                {
                    "number": 1,
                    "unit": "minute"
                }
            ],
            "range": {
                "type": "radius",
                "distance": {
                    "type": "feet",
                    "amount": 20
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": {
                    "text": "A poultice of herbs, roots, and powdered silver worth at least 50 gp, which the spell consumes.",
                    "cost": 5000,
                    "consume": true
                }
            },
            "duration": [
                {
                    "type": "timed",
                    "duration": {
                        "type": "hour",
                        "amount": 8
                    }
                }
            ],
            "meta": {
                "ritual": true
            },
            "entries": [
                "You sprinkle the poultice in a circle around you, creating a zone of protective natural magic. The spell's area becomes covered in tangled vines, blooming with sweet-smelling flowers that last for the duration of the spell. When you finish casting the spell, choose any number of creatures you can see (including yourself). These creatures have advantage on all saving throws while within the circle.",
                "When hostile creatures enter the area for the first time on their turn or start their turn within the area, the vegetation attacks them with constricting vines. They must succeed on a Dexterity saving throw or take {@damage 3d8} bludgeoning damage and become {@condition grappled} by the vines. The escape DC is equal to your spell save DC. On a success, a creature takes half damage and is not {@condition grappled}."
            ],
            "damageInflict": [
                "bludgeoning"
            ],
            "conditionInflict": [
                "grappled"
            ],
            "savingThrow": [
                "dexterity"
            ],
            "miscTags": [
                "SGT"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Druid",
                        "source": "PHB"
                    },
                    {
                        "name": "Ranger",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        },
        {
            "name": "Wrath of Roots",
            "source": "HWKS",
            "page": 0,
            "level": 7,
            "school": "C",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "range": {
                "type": "point",
                "distance": {
                    "type": "feet",
                    "amount": 120
                }
            },
            "components": {
                "v": true,
                "s": true,
                "m": "A dead plant."
            },
            "duration": [
                {
                    "type": "instant"
                }
            ],
            "entries": [
                "You summon snaking roots that erupt from the earth and enact nature's wrath. As the roots spread they tear up the ground, making it difficult terrain. Each creature within a 20-foot radius centered on a point you choose must make a Dexterity saving throw. A creature takes {@damage 7d12} bludgeoning damage and becomes {@condition restrained} on a failed save, or takes half as much damage on a success. A {@condition restrained} creature can attempt a Strength saving throw at the end of its turn, ending the effect on a success. A nonmagical object that isn't being worn or carried takes double damage if it's in the spell's range.",
                "When casting the spell, you can choose to have the roots shoot up into the air instead of spreading laterally. If you do so, the radius of the spell is reduced to 10 feet and its vertical reach is increased to 40 feet. Any flying creatures within the area of the spell's effect that fail the saving throw are forced to the ground and are {@condition restrained} (but do not suffer any falling damage)."
            ],
            "entriesHigherLevel": [
                {
                    "type": "entries",
                    "name": "At Higher Levels",
                    "entries": [
                        "When you cast this spell using a spell slot of 8th level or higher, increase the bludgeoning damage dealt by the spell by {@dice 2d12} for every slot level above 7th."
                    ]
                }
            ],
            "damageInflict": [
                "bludgeoning"
            ],
            "conditionInflict": [
                "restrained"
            ],
            "savingThrow": [
                "dexterity",
                "strength"
            ],
            "miscTags": [
                "SMN"
            ],
            "classes": {
                "fromClassList": [
                    {
                        "name": "Sorcerer",
                        "source": "PHB"
                    },
                    {
                        "name": "Wizard",
                        "source": "PHB"
                    }
                ]
            }
        }
    ],
    "feat": [
        {
            "name": "First Responder",
            "source": "HWKS",
            "page": 0,
            "entries": [
                "You have been specially trained in magical triage and are able to identify the signs of shock and fatigue in those suffering from injuries. You are always ready to provide aid to those in need. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can tell by looking at a creature if it is missing any of its hit points and whether or not it has more than half of its hit points. You also instantly determine if the creature is cursed, diseased, possessed, or afflicted by any of the following conditions: {@condition blinded}, {@condition deafened}, {@condition exhaustion}, {@condition frightened}, {@condition incapacitated}, {@condition paralyzed}, {@condition petrified}, {@condition poisoned}, or {@condition stunned}.",
                        "You learn the spare the dying cantrip and can cast it as a bonus action.",
                        "You gain the ability to cast the spell {@spell cure wounds} without using a spell slot, up to a number of times equal to half your proficiency bonus. You regain all expended uses when you finish a long rest. Wisdom is your spellcasting ability for this spell."
                    ]
                }
            ]
        },
        {
            "name": "Flamewoken",
            "source": "HWKS",
            "page": 0,
            "entries": [
                "Living in the Scorched Grove or other areas touched by elemental fire can sometimes cause strange abilities to manifest among their inhabitants. Known as \"flamewoken\" by the Tenders, these gifted few have an ability to communicate with fire-aspected creatures and have power over flames. Tenders teach flamewoken among their order to hone their talents in service of nature. However, those outside of the order usually choose to keep their abilities hidden, as such powers are often seen as a curse. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can speak, read, and write Ignan.",
                        "You learn the {@spell produce flame} cantrip. Wisdom is your spellcasting ability for this spell.",
                        "As a bonus action, you can strengthen the power of your flames. The next time you deal fire damage to one or more creatures before the end of your next turn, you can deal an additional {@damage 2d10} fire damage to one of those creatures. Once you use this feature, you can't use it again until you complete a short or long rest.",
                        "You can whisper magical words in Ignan toward any nonmagical flames you can see within 30 feet of you that could fit within a 5-foot cube. As a bonus action, you can cause these flames to either grow by 5 feet in a single direction, provided there is fuel of some sort present in the new location, or you can extinguish the flames present in this space."
                    ]
                }
            ]
        },
        {
            "name": "Forest Sage",
            "source": "HWKS",
            "page": 0,
            "prerequisite": [
                {
                    "other": "Druid"
                },
                {
                    "other": "Wizard"
                }
            ],
            "entries": [
                "The Tenders value diversity among ideas, and although they began as a purely druidic order, they have since learned to accept many different ways of thinking about the natural world, especially regarding the application of magic. You are either a wizard who has learned to temper your arcane research with an eye to maintaining the delicate balance of natural forces, or you are a druid who has learned a new understanding of natural magic through study and experimentation. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Increase your Intelligence or Wisdom score by 1, to a maximum of 20.",
                        "You can use your choice of Intelligence or Wisdom to make {@skill Animal Handling}, {@skill Arcana}, {@skill Nature}, or {@skill Survival} checks.",
                        "You can choose to learn two spells from either the druid or wizard spell list. Spells you choose must be of a level you can cast. The chosen spells count as spells of your class and are added to your spellbook if you are a wizard. The chosen spells use your spellcasting ability."
                    ]
                }
            ]
        },
        {
            "name": "Plantmender",
            "source": "HWKS",
            "page": 0,
            "prerequisite": [
                {
                    "ability": [
                        {
                            "wis": 13
                        }
                    ]
                }
            ],
            "entries": [
                "One of the basic forms of Tender magic, plantmending is often taught to acolytes of the order. Plantmending can be used either to help the forest recover from disasters or to defend against hazards that might be encountered while traveling. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can touch a plant or tree as an action to determine what has occurred to it and the area within its immediate vicinity within the last 24 hours. These events are revealed to you in visions which appear as though you were present as they occurred. After using this ability on a plant, you instantly become aware of its status and health, including any blights or conditions currently affecting it.",
                        "You learn the {@spell mend plants|HWKS} and {@spell shillelagh} cantrips. Wisdom is your spellcasting ability for these spells.",
                        "You can cast either the {@spell barkskin} or {@spell spike growth} spell once, and you must complete a long rest before you can cast either spell again. Wisdom is your spellcasting ability for these spells."
                    ]
                }
            ]
        }
    ],
    "subclass": [
        {
            "name": "Circle of the Warden",
            "shortName": "Warden",
            "source": "HWKS",
            "subclassFeatures": [
                "Circle of the Warden|Druid|PHB|Warden|HWKS|2",
                "Heartbeat of the Land|Druid|PHB|Warden|HWKS|2",
                "Shared Burden|Druid|PHB|Warden|HWKS|2",
                "Sympathetic Shield|Druid|PHB|Warden|HWKS|6",
                "Aura of Calm|Druid|PHB|Warden|HWKS|10",
                "Bond of Shelter|Druid|PHB|Warden|HWKS|14"
            ],
            "className": "Druid",
            "classSource": "PHB"
        },
        {
            "name": "The Predator",
            "shortName": "Predator",
            "source": "HWKS",
            "subclassFeatures": [
                "Warlock Patron: The Predator|Warlock|PHB|Predator|HWKS|1",
                "Expanded Spell List|Warlock|PHB|Predator|HWKS|",
                "Bonus Proficencies|Warlock|PHB|Predator|HWKS|1",
                "Form of the Beast|Warlock|PHB|Predator|HWKS|1",
                "Thrill of the Hunt|Warlock|PHB|Predator|HWKS|6",
                "Fearsome Presence|Warlock|PHB|Predator|HWKS|10",
                "Uncaged Beast|Warlock|PHB|Predator|HWKS|14"
            ],
            "className": "Warlock",
            "classSource": "PHB"
        },
        {
            "name": "Leyline Magic",
            "shortName": "Leyline",
            "source": "HWKS",
            "subclassFeatures": [
                "Leyline Magic|Wizard|PHB|Leyline|HWKS|2",
                "Natural Attunement|Wizard|PHB|Leyline|HWKS|2",
                "Leyline Spells|Wizard|PHB|Leyline|HWKS|2",
                "Thrum of the Land|Wizard|PHB|Leyline|HWKS|2",
                "Biorhythm|Wizard|PHB|Leyline|HWKS|6",
                "Natural Disruption|Wizard|PHB|Leyline|HWKS|10",
                "Leyline Weaving|Wizard|PHB|Leyline|HWKS|14"
            ],
            "className": "Wizard",
            "classSource": "PHB"
        }
    ],
    "subclassFeature": [
        {
            "name": "Circle of the Warden",
            "source": "HWKS",
            "page": 11,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "Every druid has a responsibility to the natural world, but those who join the Circle of the Warden stand as sentinels of natureâ€™s balance. The Circle of the Warden specializes in divination and abjuration magics to help foresee possible imbalances and correct them before they cause irreparable damage. To druids of this circle, people are as much a part of the natural balance as plants and animals. As such, these druids can be found providing succor to those affected by natural disasters just as often as to the flora and fauna. In Humblewood, many druids who have joined the Tenders of the Scorched Grove are members of this circle, as its values align quite closely with the tenets of their order."
            ]
        },
        {
            "name": "Heartbeat of the Land",
            "source": "HWKS",
            "page": 11,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "Starting when you choose this circle at 2nd level, you form a connection to the natural world around you, and you can sense when it is in danger. You gain proficiency in the Nature and Insight skills. Your proficiency bonus is doubled for any ability check you make that uses either of those proficiencies. Additionally, by spending 10 minutes communing with nature, you can glean the following information about the area within 3 miles of you: ",
                {
                    "type": "list",
                    "items": [
                        "You learn the general location and severity of any immediate threats to the environment in the region (forest fires, flooding, blights, etc.). ",
                        "You learn if any aberrations, beasts, elementals, fey, or undead are present within range, but not their specific locations. ",
                        "You learn the general direction of the nearest portal to an elemental plane."
                    ]
                }
            ]
        },
        {
            "name": "Shared Burden",
            "source": "HWKS",
            "page": 11,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "Also at 2nd level, you learn the art of siphoning off harmful elemental energy. You can use this to lessen elemental damage being done to your allies by shouldering some of it yourself. When a creature within 30 feet of you takes cold, fire, lightning, or thunder damage, you can use your reaction to grant that creature resistance against the damage dealt. You take damage equal to the amount taken by the target creature.",
                "Additionally, you may spend an action to reduce the area of natural or magical effects which deal persistent cold, fire, or lightning damage within 30 feet of you. You may remove up to 20 feet worth of adjacent spaces from the area of such effects per use of this feature. However, for each 5-foot space of energy damage removed in this way, you take 1d6 points of damage of the same type the effect would deal. If the effect is caused by a spell, you instead take 1d6 points of damage per the spellâ€™s level for each 5-foot space removed and, if there are no damage dealing spaces remaining, the effect is dispelled. You have resistance to any damage dealt to you through this feature."
            ]
        },
        {
            "name": "Sympathetic Shield",
            "source": "HWKS",
            "page": 11,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 6,
            "entries": [
                "Starting at 6th level, you learn how to channel the energy of your beast shapes into manifestations of natureâ€™s protection. As an action, you may expend a use of your Wild Shape feature to shield yourself or an ally within 30 feet of you in the protective armor of a beast spirit. This spirit armor is translucent and doesnâ€™t block line of sight. It can take the shape of any beast you desire, though it must be a form you shape into. The shielded creature gains a +2 bonus to its AC and 1d10 temporary hit points for every 3 druid levels you possess. This effect lasts until these temporary hit points are expended or replaced by another ability which grants temporary hit points.",
                "At 14th level, the spirit armor can retaliate against foes who would attack it directly. Whenever a shielded creature is dealt damage by a target within 5 feet of it, the spirit armor deals 1d8 points of magical bludgeoning, piercing, or slashing damage to that target. This damage type is chosen by the druid when activating Sympathetic Shield."
            ]
        },
        {
            "name": "Aura of Calm",
            "source": "HWKS",
            "page": 11,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 10,
            "entries": [
                "Starting at 10th level, your presence radiates an aura of soothing natural magic. Whenever you or a friendly creature within 10 feet of you receives healing from a spell, that spell restores an additional number of hit points equal to half your druid level. Additionally, all plants that arenâ€™t creatures within this aura grow thick and plentiful and are restored to their full vigor. Such plants also become safe to travelers while inside the aura, negating difficult terrain caused by plants, including magical effects such as entangle or spike growth, and granting advantage on any saving throws made to resist the harmful effects of such spells."
            ]
        },
        {
            "name": "Warlock Patron: The Predator",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 1,
            "entries": [
                "Your patron is a primal beast, driven by a bloodthirsty need to hunt. These beings tempt creatures to give in to their base instincts and become apex predators. Ancient white dragons, demons with a bestial bent, and the Amaranthine Kren have all been known to occasionally grant feral powers to those desperate enough to seek their aid. Many who strike a pact with a Predator find themselves forever changed, bearing razor teeth and wicked claws, an aspect of their predatory patron."
            ]
        },
        {
            "name": "Expanded Spell List",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 0,
            "entries": [
                "The Predator lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you. Spells marked with an asterisk can be found in the Humblewood Campaign Setting book.",
                {
                    "type": "table",
                    "caption": "",
                    "colLabels": [
                        "Spell Level",
                        "Spells"
                    ],
                    "colStyles": [
                        "col-2 text-center",
                        "col-10"
                    ],
                    "rows": [
                        [
                            "1st",
                            "{@spell hunterâ€™s mark}, {@spell jump}"
                        ],
                        [
                            "2nd",
                            "{@spell alter self}, {@spell ambush prey|Humblewood}*"
                        ],
                        [
                            "3rd",
                            "{@spell blink}, {@spell slow}"
                        ],
                        [
                            "4th",
                            "{@spell dominate beast}, {@spell freedom of movement}"
                        ],
                        [
                            "5th",
                            "{@spell contagion}, {@spell mislead}"
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Bonus Proficencies",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 1,
            "entries": [
                "Starting at 1st level, your patron grants you enhanced tracking skills. You are proficient with the Survival skill, and you add double your proficiency bonus to any Wisdom (Survival) skill checks you make."
            ]
        },
        {
            "name": "Form of the Beast",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 1,
            "entries": [
                "At 1st level, you can use your bonus action to channel the ferocity and guile of your patron, transforming into a beastly figure. For 10 minutes, you gain the following abilities:",
                "You are flooded with adrenaline, feeling nothing besides the thrill of the hunt. You gain temporary hit points equal to five times your warlock level, up to a maximum of 50 temporary hit points at 10th level. These temporary hit points last until the end of your transformation.",
                {
                    "type": "list",
                    "items": [
                        "Your senses become supernaturally keen. You have advantage on Dexterity (Stealth), Wisdom (Perception), and Wisdom (Survival) checks you make to track or stalk your prey.",
                        "You sprout a set of pointed teeth and razor-sharp claws, which are natural weapons you can use to make unarmed strikes against creatures within 5 feet of you. You have proficiency with these weapons and can use your Charisma modifier for their attack and damage rolls. On a hit, your bite deals 1d6 piercing damage, and your claws deal 1d4 slashing damage. If you already had a bite or claw attack (talon attacks count as claw attacks), its damage increases by one step (a d4 becomes a d6, a d6 becomes a d8, etc.). As a bonus action after making a bite attack, you can make a claw attack.",
                        "Starting at 5th level, your muscles grow, and your movements quicken. When you take a bonus action to make a claw attack, you make two claw attacks instead of one. Additionally at 5th level, you can take the Dash action as bonus action."
                    ]
                },
                "You can use this feature twice per short or long rest. At 6th level, your transformation lasts for 1 hour instead of 10 minutes."
            ]
        },
        {
            "name": "Thrill of the Hunt",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 6,
            "entries": [
                "At 6th level, you gain the ability to feast on the vitality of your foes while transformed into your Form of the Beast. Once per turn when you hit a creature with your bite attack, you can cause the attack to deal an extra 3d6 points of necrotic damage. You regain a number of hit points equal to the total damage dealt with this attack.",
                "Once you use this feature, you canâ€™t use it again until you score a critical hit with a bite or claw attack or until you finish a short or long rest.",
                "At 10th level, the extra necrotic damage provided by this feature increases to 5d6."
            ]
        },
        {
            "name": "Fearsome Presence",
            "source": "HWKS",
            "page": 11,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 10,
            "entries": [
                "At 10th level, you learn how to channel the presence of a frightful beast, even when not transformed. You can use your action to cause each hostile creature you can see within a 30-foot radius to succeed on a Wisdom saving throw against your spell save DC or become frightened of you for 1 minute. Creatures who fail their saving throw are also restrained until the end of your next turn. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
                "Once you use this feature, you canâ€™t use it again until you finish a short or long rest."
            ]
        },
        {
            "name": "Leyline Magic",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "The primal forces which comprise nature have their own magical energy, one which can be harnessed by wizards with proper training. By drawing their power from nature, leyline wizards can tap into primordial reservoirs of magic to gain access to new spells, empower their own spellcasting, or disrupt opposing forces which attempt to take root in their domain. The most powerful of such wizards can sew new leylines, transforming unnatural or inhospitable places into natural paradises with time. These wizards work closely with druids, and they can gradually heal environments that have been blighted or corrupted."
            ]
        },
        {
            "name": "Natural Attunement",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "When you choose this arcane tradition at 2nd level, you learn how to attune yourself to the magic of leylines which course through nature. Each day when you prepare your spells in a natural setting, you may also attune yourself to the energy of a leyline. When you do, choose a list of circle spells from the druidâ€™s Circle of the Land which match the environment in which you prepared your spells. These become your leyline spells, and the druid level shown on each list represents the minimum wizard level you must have to access the listed spells. In some cases, you can choose from multiple options based on the terrain (for example, a frozen shoreline might provide you with either the Arctic or the Coast spell lists). You can only be attuned to one leyline at a time.",
                "While attuned to a leyline, you gain access to any spells on your current list of leyline spells for which you meet the level requirement. For as long as you are attuned to a leyline, you always have these spells prepared, and they donâ€™t count against the number of spells you can prepare each day. Leyline spells are not copied into your spellbook."
            ]
        },
        {
            "name": "Leyline Spells",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "Add the following spells to each leyline spell list. These are available to wizards at 2nd level. Spells marked with an asterisk can be found in the Humblewood Campaign Setting book.",
                {
                    "type": "table",
                    "caption": "Black Magic Bonus Spells",
                    "colLabels": [
                        "Circle Spells",
                        "Added Spells"
                    ],
                    "colStyles": [
                        "col-2 text-center",
                        "col-10"
                    ],
                    "rows": [
                        [
                            "Arctic",
                            "{@spell grease}, {@spell Spiny Shield|Humblewood}*"
                        ],
                        [
                            "Coast",
                            "{@spell create or destroy water}, {@spell thunderwave}"
                        ],
                        [
                            "Desert",
                            "{@spell color spray}, {@spell create or destroy water}"
                        ],
                        [
                            "Forest",
                            "{@spell entangle}, {@spell Veil of Dusk|Humblewood}*"
                        ],
                        [
                            "Grasslands",
                            "{@spell burning hands}, {@spell Elevated Sight|Humblewood}*"
                        ],
                        [
                            "Mountain",
                            "{@spell fog cloud}, {@spell thunderwave}"
                        ],
                        [
                            "Swamp",
                            "{@spell faerie fire}, {@spell Veil of Dusk|Humblewood}*"
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Thrum of the Land",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 2,
            "entries": [
                "Also at 2nd level, you learn how to channel energy from leylines to supplement your spells, infusing them with power. Whenever you are in an environment that matches a leyline to which you are attuned, you can apply one of the following benefits to any leyline spell you cast (chosen when you cast the spell):",
                {
                    "type": "list",
                    "items": [
                        "You gain a +2 bonus to attack rolls made with this spell.",
                        "You gain a +1 bonus to your spell save DC for this spell.",
                        "You have advantage on Constitution saving throws you make to maintain concentration on this spell, and you can concentrate on this spell for up to twice as long as it would normally allow."
                    ]
                },
                "At 14th level, you can apply one of these benefits to a single spell of 6th level or higher when you cast it, so long as you are in an environment that matches a leyline to which you are attuned. You canâ€™t use this feature again until you have completed a long rest."
            ]
        },
        {
            "name": "Biorhythm",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 6,
            "entries": [
                "At 6th level, you learn how to channel the leylineâ€™s energies to augment your bodyâ€™s natural healing. As long as you are attuned to a leyline, whenever you use your Arcane Recovery feature to regain expended spell slots, you regain 1d8 hit points for each spell slot you recover.",
                "Additionally, when you complete a short rest in a natural setting, you can attune yourself to a different leyline, following the rules of your Natural Attunement feature."
            ]
        },
        {
            "name": "Natural Disruption",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 10,
            "entries": [
                "By 10th level, you can channel energy from your leyline to disrupt opposing magic. You can cast counterspell or dispel magic, without expending a spell slot, at the level of the highest spell slot available to you.",
                "Once you use this feature, you canâ€™t use it again until you finish a long rest."
            ]
        },
        {
            "name": "Leyline Weaving",
            "source": "HWKS",
            "page": 14,
            "className": "Wizard",
            "classSource": "PHB",
            "subclassShortName": "Leyline",
            "subclassSource": "HWKS",
            "level": 14,
            "entries": [
                "At 14th level, you have learned how to alter the properties of magic around you, temporarily infusing even unnatural or hostile environments with the power of your leyline. By spending 1 hour in meditation, you can create a new leyline. This new leyline affects a 1-mile-radius area from the spot you meditated upon, which counts as the environment of the list of leyline spells you are attuned to for the purposes of using your leyline abilities. It is hard for a leyline to take root in unfamiliar spaces, and in 24 hours this effect dissipates.",
                "However, by using this ability to create the same type of leyline on the same spot each day for a full year, you can cause the effect to be permanent. This will forever alter the natural landscape within the zone you created, and you can choose whether the environment within this zone matches your leyline or combines the features of your leylineâ€™s environment with those naturally present."
            ]
        },
        {
            "name": "Uncaged Beast",
            "source": "HWKS",
            "page": 14,
            "className": "Warlock",
            "classSource": "PHB",
            "subclassShortName": "Predator",
            "subclassSource": "HWKS",
            "level": 14,
            "entries": [
                "Upon reaching 14th level, you become even more ferocious when pushed to your limits. While transformed into your Form of the Beast, if you take damage from a creature that is within 5 feet of you, you can use your reaction to make a bite or claw attack against that creature.",
                "Additionally, when an attacker that you can see hits you with an attack, you can use your reaction to immediately transform into your Form of the Beast. If you do this, subtract the damage this attack would deal from the temporary hit points granted by your transformation; any excess damage carries over to your hit points. As part of your reaction to transform, you may immediately retaliate against your attacker with a bite or claw attack, so long as your attacker is within 5 feet of you."
            ]
        },
        {
            "name": "Bond of Shelter",
            "source": "HWKS",
            "page": 14,
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Warden",
            "subclassSource": "HWKS",
            "level": 14,
            "entries": [
                "Once you reach 14th level, your service to the natural balance is rewarded, and nature itself rises to protect you and your allies from harm. As an action, you can create a 30-foot-radius, 20-foot-tall cylinder of protective energy, centered on your current position at the time you create it. This cylinder lasts for 1 hour.",
                "As long as you are on the Material Plane or an elemental plane, natural features in the area, including plants, trees, rocks, and water (as well as wind, water, earth, or fire, if on an elemental plane) animate to defend you. If not in a setting where natural features are present, plants, trees, rocks, and other natural elements sprout from the earth before animating.",
                "When you activate this ability, choose any number of creatures you are familiar with to be immune to the effect. The cylinder affects each other creature in the following ways:",
                {
                    "type": "list",
                    "items": [
                        "Affected creatures canâ€™t willingly enter the cylinder unless they succeed on a Charisma saving throw against your spell save DC. The cylinder also protects the area against planar travel for the duration, and therefore prevents any creature from accessing the area by way of the Astral Plane, Ethereal Plane, Feywild, Shadowfell, or the plane shift spell.",
                        "Affected creatures have disadvantage on attack rolls against targets within the cylinder.",
                        "Targets within the cylinder canâ€™t be charmed, frightened, or possessed by affected creatures.",
                        "When an affected creature enters the cylinder for the first time on a turn or starts its turn there, the creature takes 5d10 magical bludgeoning damage from the animated nature within."
                    ]
                },
                "Once you use this feature, you canâ€™t do so again until you finish a long rest."
            ]
        }
    ],
    "optionalfeature": [
        {
            "name": "Feral Transformation",
            "source": "HWKS",
            "entries": [
                "Prerequisite: 7th level As an action, you can transform into a dire wolf, giant spider, or giant vulture following the same rules as the polymorph spell, but you retain your Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creatureâ€™s bonus instead of yours. You maintain the ability to speak and can cast spells that have only a verbal component. ",
                "You maintain this form for 1 hour or until the form drops to 0 hit points, at which point you revert back to your normal form. ",
                "Once you use this invocation, you canâ€™t use it again until you finish a short or long rest."
            ],
            "featureType": "EI",
            "prerequisite": [
                {
                    "level": {
                        "level": 7
                    }
                }
            ]
        }
    ],
    "book": [
        {
            "name": "Humblewood Kickstarter Content",
            "id": "HWKS",
            "source": "HWKS",
            "author": "Deck of Many",
            "published": "",
            "coverUrl": "https://i.ibb.co/PMqwcVK/humblewood-cover.png",
            "contents": [
                {
                    "name": "Humblewood Kickstarter Content",
                    "headers": [
                        "Foreword"
                    ]
                },
                {
                    "name": "New Magic Items",
                    "headers": [
                        "Magic Items"
                    ]
                },
                {
                    "name": "Tenders of the Scorched Grove",
                    "headers": [
                        "The Tenders",
                        "Tender Characters",
                        "New Feats",
                        "New Spells",
                        "New Character Options"
                    ]
                },
                {
                    "name": "Humblewood Spells, Vol 2",
                    "headers": [
                        "Spells"
                    ]
                }
            ]
        }
    ],
    "bookData": [
        {
            "id": "HWKS",
            "source": "HWKS",
            "data": [
                {
                    "type": "section",
                    "name": "Humblewood Kickstarter Content",
                    "entries": [
                        {
                            "type": "section",
                            "name": "Foreword",
                            "entries": [
                                "This is a collection of all the Kickstarter rewards for the Humblewood Campaign Setting."
                            ]
                        }
                    ]
                },
                {
                    "type": "section",
                    "name": "New Magic Items",
                    "entries": [
                        {
                            "type": "section",
                            "name": "Magic Items",
                            "entries": [
                                "There are many magical items to be found in the expansive forests, marshland caves, cliffside burrows, and mountain ruins of the ancient land of Humblewood. These magical items embody the essence of the Wood, and include mystic tools crafted by gifted spellcasters, rare treasures yet to be discovered, and fabled artifacts lost to time.",
                                {
                                    "type": "table",
                                    "colLabels": [
                                        "Rarity",
                                        "Item",
                                        "Attunement"
                                    ],
                                    "colStyles": [
                                        "col-2 text-center",
                                        "col-7 text-center",
                                        "col-3 text-center"
                                    ],
                                    "rows": [
                                        [
                                            "Uncommon",
                                            "{@item antlers of the true path|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item belt of the weald|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item cloak of spines|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item crown of daffodils|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item glowing ember|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item kwark's wonderous kernels|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item marotte of chance|HWKS}",
                                            "By a Luma"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item ring of plant-speech|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item staff of climbing ivy|HWKS}",
                                            "By a Bard, Druid, Sorceror, or Warlock"
                                        ],
                                        [
                                            "Uncommon",
                                            "{@item talons of the squall|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Rare",
                                            "{@item band of fruitfulness|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Rare",
                                            "{@item cogwork wings|HWKS}",
                                            "No"
                                        ],
                                        [
                                            "Rare",
                                            "{@item eye of starsight|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Rare",
                                            "{@item fangs of guile|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Rare",
                                            "{@item ring of the sky hunter|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Rare",
                                            "{@item the chronicles of fools|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Very Rare",
                                            "{@item feather robe|HWKS}",
                                            "By a Sorcerer, Warlock, or Wizard"
                                        ],
                                        [
                                            "Very Rare",
                                            "{@item flame of ingenuity|HWKS}",
                                            "By a bard, Sorcerer, or Wizard"
                                        ],
                                        [
                                            "Very Rare",
                                            "{@item pathfinder's pebble|HWKS}",
                                            "By a Cleric of the Nature Domain, Druid, or Ranger"
                                        ],
                                        [
                                            "Very Rare",
                                            "{@item saber of unity (rapier)|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Very Rare",
                                            "{@item saber of unity (scimitar)|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Legendary",
                                            "{@item egg of rebirth|HWKS}",
                                            "Yes"
                                        ],
                                        [
                                            "Legendary",
                                            "{@item shroud of ending|HWKS}",
                                            "Yes"
                                        ]
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "section",
                    "name": "Tenders of the Scorched Grove",
                    "entries": [
                        {
                            "type": "section",
                            "name": "The Tenders",
                            "entries": [
                                "Hundreds of songs ago, in the already ancient forest of Humblewood, a wise birdfolk sage bonded with the treants who stewarded the groves of the Wood. The treants taught the sage about the forest, the creatures they shared it with, and how all are cradled within the Great Rhythmâ€™s embrace. The sage used their teachings to found the Tenders, an order sworn to uphold the balance of natural forces. Although the sageâ€™s name has been lost to history, the Tenders persist to this day.",
                                "As humble caretakers of the Wood, the first Tenders studied the interconnectedness of all life as well as the practice of gentle, natural magic. The treantsâ€™ teachings helped the Tenders heal the forest from blights and fires. Following the example of the treants, they tended small village grovesand used their magic to provide support in times of hardship. Possessing a deep insight into the Great Rhythm, the Tenders came to be seen as a bridge between the will of the Wood and the people who lived there. Over a few hundred songs until they became an established presence in the Wood.",
                                "The order faced itâ€™s greatest challenge during the Great Calamity. As fires raged unabated, incinerating nearly a third of Humblewoodâ€™s woodland, the Tenders helped those fleeing the blaze. The flames of the Great Calamity forged the Scorched Grove, and the Tenders took it upon themselves to restore the corrupted earth. Their search to correct the elemental imbalance of the Scorched Grove led the Tenders to incorporate disparate schools of magic into their teachings. Most notably they managed to merge the scholarly approach of Avium wizards with the harmonious teachings of their druidic arts. With this new understanding of arcana, the Tenders have made steady progress toward healing the Groveâ€™s corruption.",
                                "As certain Tenders dedicated their lives to healing the Scorched Grove, others pledged to mend the world in different ways. Some organized into a force of first responders to protect the Wood against natural upheavals, while others became healers, teachers, and tree-shapers. Others traveled across Everden, where they discovered lands with dangerous elemental imbalances. This divided the order into distinct chapters, or Branches. Each Branch of the Tenders has an elected leader, called a treekeeper. Once every fifty songs Branch treekeepers convene to share what their Branch has learned. Treekeepers also hold urgent meetings when necessary, but are otherwise absorbed in their most important duty: seeking answers that may heal the damaged areas of Everden.",
                                {
                                    "type": "entries",
                                    "name": "Tenders in the World",
                                    "entries": [
                                        "All Tenders are united by a shared set of goals, despite how different Branches might seek to achieve them. Tenders view themselves as wise teachers, dedicated to guiding others toward a life in balance with the Great Rhythm. They are also diligent sentinels, dedicated to foreseeing and averting threats to this balance, both natural and manufactured. This duty extends to safeguarding hazardous magics and powerful artifacts lest they fall into the wrong hands. When nature summons up storms, floods, or other life-threatening events, the Tenders work to lessen their harm, providing help for those injured or displaced, and repairing damage wrought to the ecosystem. Finally, the Tenders have a duty to tend to areas that have been scarred or corrupted by strong elemental energies. This includes shielding people from the monstrous creatures that live in such areas,and gradually restoring the balance of elemental energies to help the land return to a natural state.",
                                        "Everden is home to many branches, three of which are described here."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Tenders of the Scorched Grove",
                                    "entries": [
                                        "The first proper Branch of the order was the Tenders of the Scorched Grove. This group of Humblewood Tenders were names following the events of the Great Calamity. The Tenders of the Scorched Grove work to heal the flame-scarred western area of Humblewood from which they take their name. Members of this Branch regularly make pilgrimages to the Scorched Grove to learn from the elders there. Some put down roots in the Grove and dedicate their lives to keeping watch over the area. Due to the dangers present in and around the Scorched Grove, this Branch faces greater risks than many other Tender chapters. The Tenders of the Scorched Grove are also trusted to maintain the most extensive records of the order. They are led by a corvum mystic named Janily of the Everchanging Sky. Janily is currently on a spiritual quest to the far corners of Everden, a journey on which she hopes to uncover the secret to healing the Scorched Grove."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Tenders of the Crystal Wastes",
                                    "entries": [
                                        "The Tenders of the Crystal Wastes were among the first Branches established outside of Humblewood in the neighboring land of Firnveldt. Their chapter was founded to contain a spreading expanse of hoarfrost, known as the Crystal Wastes, that persistently encroaches on the Rimewood and the regionâ€™s green plains. Initially established by members of the Tenders of the Scorched Grove, this Branch has since grown to differentiate itself through a more contemplative and judicious approach to their duties. They keep a solemn vigil in mighty fortresses, bulwarks against the encroaching ice. They are led by a perceptive and intelligent raptor called Cain of the Sunsworn Oath, who possesses a boundless curiosity. He scours the often-dangerous ruins of ancient civilizations, searching for any lost lore that may help their cause."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Tenders of the Tanglewilds",
                                    "entries": [
                                        "A more recently founded Branch, the Tenders of the Tanglewilds were established in the great jungle from which they take their name. Their tales tell of a group of locals who were inspired by a traveling treekeeper to take up the task of protecting their rainforest home from harm. The Branch has since organized into a force known throughout the region for their valor and dedication. Most of their number are rangers who live off the land and are experienced in recognizing disturbances in the natural balance. Their leader is a luma known only as Grandmother Orchid, who is rumored to have lived for hundreds of songs. Unlike other treekeepers, Grandmother Orchid only travels when she must convene with other Branch leaders. Tanglewild Tenders say that she spends her days in meditation within the tangled roots of an enormous tree, feeling the pulse of the entire world."
                                    ]
                                },
                                {
                                    "type": "inset",
                                    "name": "The Treants of the Humblewood",
                                    "entries": [
                                        "I remember the treants. So large and powerful they were, but gentle as the spring. Those who come after may not know of their kindness, nor of their great sacrifice, yet it is because of them that we still dwell in Humblewood. We owe them a debt that cannot be repaid.",
                                        "When the fires of the Great Calamity blazed out of control, it was the treants who rose to our protection. They came from all over the Wood to surround the accursed conflagration. Skilled in the primordial magic of the very first druids, the eldest of their kind used their awesome power to form a barrier against the inferno. Their leaves burned to ash, their bodies charred and splintered. Through it all, the treants stood tall and firm, sheltering the Wood until a ritual abated the Calamityâ€¦though who knows for how long.",
                                        "I suspect that, to whomever reads this, it may be hard to believe that treants were once a common sight in the Wood. Indeed, they could often be seen strolling through the hillsides. Each treant with its own grove, tended to the trees and all living things within them. The old stories say it is from the treants that we took our name, for we too aspired to be Tenders of the forest. Being long-lived, they knew much of the Woodâ€™s history, and, though towering creatures, not even the smallest seed escaped their notice. Above all else, they were teachers, and that is what Tenders must strive to be. With the eldest and wisest of the treants lost to the flames, we must take their place, not only as keepers of lore and stewards of nature, but as those who tend to the very spirit of this world.",
                                        "Althander of the New Leaf, ",
                                        "Autumnal From a weathered journal kept in the Tenderâ€™s archives"
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Tender Characters",
                            "entries": [
                                "Characters who are part of the Tenders are usually goodaligned and are rarely evil. One of the pillars of the order is compassion for all life. Those who act maliciously often find themselves shunned not only by their fellow Tenders, but by the forest itself. Tenders also embrace neutral alignments, for they are taught to respect the balance of nature. Although the Tenders are an order rooted in birdfolk tradition, members of all races are welcome among their ranks. While characters of all classes and backgrounds can make good Tenders, the order counts a large number of druids, monks, rangers, and wizards among them. As an organization with strong ties to the birdfolk pantheon, especially Hanera, clerics are often found in their ranks as well.",
                                "You should consider playing a Tender if:",
                                {
                                    "type": "list",
                                    "items": [
                                        "You like the idea of being a member of an order that works behind the scenes to avert threats before they manifest.",
                                        "You want to play a spellcaster with a deep respect and curiosity for natureâ€™s mysteries.",
                                        "You want to play an active part in saving humblefolk and birdfolk from the ravages of forest fires, floods, and other natural and unnatural disasters.",
                                        "You wish to bring about a world where birdfolk and humblefolk live in harmony both with nature and each other."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Becoming a Tender",
                                    "entries": [
                                        "Tenders teach that the Great Rhythm exists in a delicate balance. If this natural balance is ever broken, the Rhythm will eventually correct itself, but the ensuing chaos will cost many lives and irrevocably alter or damage many ecosystems. According to the Tenders, survival of the fittest is an inhumane doctrine; it is far better if harmony can be maintained for the collective benefit of everyone.",
                                        "Joining the Tenders is not difficult as recruits are sorely needed due to the orderâ€™s thinning numbers. Anyone who shows proper devotion to the tenets of natural balance can swear an oath to become a keeper of harmony."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Roles within the Tenders",
                                    "entries": [
                                        "There are a variety of roles within the Tenders that members can fill. These roles denote a memberâ€™s primary focus within the order.",
                                        {
                                            "type": "entries",
                                            "name": "Wardens",
                                            "entries": [
                                                "Wardens work as first responders after a natural disaster. They provide relief by setting up temporary shelters for creatures who have been displaced and use natural magic to heal surviving flora and fauna. They also go on missions to survey dangerous areas or investigate situations that could pose a danger to nature. Classes with an aptitude for healing magic excel at this role, especially rangers and paladins of nature."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Emberwardens",
                                            "entries": [
                                                "A role unique to the Tenders of the Scorched Grove, emberwardens have dedicated their lives to the revitalization of the flame-cursed wastes. Many emberwardens are clerics and monks, as their lifestyle is one of monastic discipline and contemplation."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Heartbraiders",
                                            "entries": [
                                                "Heartbraiders serve as mediators between people and nature. They help spread the Tendersâ€™ teaching that the two are inseparable. Usually, they are employed as shapers in Alderheart or as groundskeepers in Tender-operated groves. Heartbraiders are frequently druids."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Woodsages",
                                            "entries": [
                                                "Rather than take on an active role, woodsages work behind the scenes. They work in the Tendersâ€™ archives, ensuring that new and old records are preserved in the large repository of knowledge. Some of this archived knowledge could be dangerous if ever it were released, so it is watched overby a circle of high-ranking Tenders, the autumnals. Wizards and other spellcasters are often woodsages."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Your place in the Order",
                                    "entries": [
                                        "Whereas roles in the Tenders describe the focus of a memberâ€™s efforts, ranks denote different levels of respect and trust within the order. Higher-ranking members have demonstrated a deeper understanding of the natural balance of the Great Rhythm and their place within it. The higher the memberâ€™s rank, the more they are encouraged to round out their experience through contemplation, study, in addition to direct experience in the field. Adopting this doctrine, a Tender learns how to balance the spiritual, academic, and practical elements of the orderâ€™s teachings.",
                                        "These ranks are not meant to be advanced through quickly. A good rule of thumb is that the transition from one rank to the next should accompany a story beat.",
                                        {
                                            "type": "entries",
                                            "name": "Seedling",
                                            "entries": [
                                                "You have attained the lowest rank in the Tenders, representing the first stage of growth. At this stage the seed of knowledge has been planted and now must be nurtured. You are granted access to most of the Tender archives, excluding texts guarded by the autumnals. If you show promise in the order, you will be posed a sacred riddle to provoke thought on the balance of nature and your place within it.",
                                                "As a seedling you are taught a ritual which allows you to commune with nature and befriend a minor forest spirit. The forest spirit takes on the form of a Small or Tiny beast of challenge rating 0 of your choice. The forest spirit has the statistics of the chosen form, though it is an elemental, fey, or plant (your choice) instead of a beast.",
                                                "The forest spirit acts independently from you. It is friendly toward you and generally follows your instructions, but if you willingly harm nature or act in ways that are malicious or evil, the forest spirit abandons you. In combat, it rolls its own initiative and acts on its own turn. The forest spirit disappears when it drops to 0 hit points, leaving behind no physical form.",
                                                "It reappears after you spend an hour communing with nature.",
                                                "Your forest spirit can communicate with you telepathically as long as you are within 100 feet of each other. Additionally, your forest spirit can communicate with any creature with which it shares a type.",
                                                "You canâ€™t befriend more than one forest spirit at a time. If you perform the ritual while you already have a forest spirit, you instead cause your forest spirit to adopt the form of a different Small or Tiny beast with a challenge rating of 0 of your choice.",
                                                {
                                                    "type": "inset",
                                                    "name": "The First Riddles",
                                                    "entries": [
                                                        "The first riddles are a collection of thought experiments which can be posed to seedlings to give them a chance to ruminate on the teachings of the order. A riddle is given to a new member who shows promise or a desire to advance further within the order. Upon giving an answer which shows an understanding of the cycles of nature and the great balance that keeps the world together, they then become eligible to progress to the next rank.",
                                                        "For example, when asked, â€œIs the hawk mightier than the rabbit?â€ a simple answer might be that the hawk is mightier because it is a terrifying predator, but an answer that shows an understanding of the forces of nature would be that neither one is mightier. The hawk relies on the rabbit to live, and when the hawk dies, its remains nourish the soil which grows the grass that the rabbit eats. A few sample riddles are given below, and whether or not an answer is accepted is up to the GM.",
                                                        {
                                                            "type": "list",
                                                            "items": [
                                                                "Why must the leaves die in autumn?",
                                                                "How is a tree like a community?",
                                                                "Which came first, morning or twilight?",
                                                                "What is the drop of water to a stream?"
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Sproutling",
                                            "entries": [
                                                "{@italic Prerequisites: Seedling rank in Tenders, and must have answered one of the first riddles of the order}",
                                                "You have answered one of the first riddles and begun your journey along the path to true wisdom. Sproutlings are encouraged to study natural magic, to understand how it feeds from the primal energies of nature. This is where many internalize the â€œslow way is the best wayâ€ approach advocated by the order, and where some begin to branch off into studies of the arcane. Sproutlings are likewise encouraged to supplement their independent learning with wisdom from more experienced members of the order.",
                                                "As a sproutling, you will never find yourself wanting for a teacher. You can ask a Tender {@creature druid} of sapling or higher rank for help with a problem you are currently facing. The GM will decide which NPC you have access to and the NPCâ€™s rank. The NPC makes every reasonable effort to assist you but may only be able to offer information or advice. In some situations, the NPC may explain that it is necessary to step back in order to allow you to learn through adversity. In other situations, an NPC may insist on accompanying you or bringing the matter to the attention of higher-ranking members of the order."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Flamewarden (Special Role)",
                                            "entries": [
                                                "{@italic Prerequisites: Sproutling or higher rank in Tenders of the Scorched Grove, and must have taken the Oath of Flame}",
                                                "In attaining this special rank you have dedicated your life to healing the imbalance in the Scorched Grove, watching over areas that have been claimed by it, and understanding the strange creatures that make the Grove their home. As a emberwarden, you can still advance in ranks as normal, but your charge requires that you return to the Scorched Grove when not adventuring to continue your vigil.",
                                                "You learn how to speak, read, and write Ignan (or another language if you already know Ignan). Additionally, you have advantage on Intelligence, Wisdom, and Charisma checks you make related to fire-based creatures of the Scorched Grove."
                                            ]
                                        },
                                        {
                                            "type": "inset",
                                            "name": "The Oath of Flame",
                                            "entries": [
                                                "This oath is recited in a special ceremony by those who wish to take on the mantle of emberwarden and dedicate themselves to tending the Scorched Grove.",
                                                {
                                                    "type": "entries",
                                                    "entries": [
                                                        " ",
                                                        "I pledge upon the roots of the world to watch the flame that blights this land",
                                                        "To revive the green where ash now swirls, to shepherd fire with steady hand",
                                                        "To keep safe all who do here tread, to learn the secrets ash can teach",
                                                        "To honor treants charred and dead, to keep their final hope in reach",
                                                        "This pledge I make becomes my oath, a covenant with errant flame",
                                                        "To Humblewood and nature both, and all life in the Rhythmâ€™s name"
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Sapling",
                                            "entries": [
                                                "{@italic Prerequisites: Sproutling rank in Tenders, and either the ability to cast the spell cure wounds or proficiency in the Medicine skill}",
                                                "You now have the experience and wisdom to apply your knowledge in practical service of natural balance. You are also expected to help lower-ranking members who ask for your advice.",
                                                "As a sapling, you may be tasked with journeying across the Wood as an official warden of the Tenders. While acting in this capacity, when reasonable and possible you can count on villagers to offer free lodging. When assigned a mission, you can ask a summerblossom to borrow a treasure of the order to help you complete your task. You can choose from among {@item antlers of the true path|HWKS}*, a {@item belt of the weald|HWKS}*, or a {@item ring of animal influence|HWKS}. Whichever object you pick must be returned once the mission is complete. The GM decides which of these treasures, if any, you have access to."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Summerblossom",
                                            "entries": [
                                                "{@italic Prerequisites: Sapling rank in Tenders, and a show of valor for the sake of the order}",
                                                "You have shown your ability to marry study and experience in the service of nature, as well as demonstrated that you have both the courage and the wisdom to lead. As a summerblossom, you are tasked with mentoring others in the order, directing the movements of lower-ranking members, and leading wardens in the field when necessary. While you donâ€™t have the same ability to communicate with the treekeeper as autumnals, any concern you pass onto an autumnal will be taken seriously. You may also access the most heavily guarded lore in the Tendersâ€™ archives, though you must first obtain permission from the autumnals, who oversee its safekeeping. You are responsible for directing the efforts of lower-ranking members of the order based on information shared with you by the autumnals. You lead a team of {@dice 2d6} {@creature acolyte}s and {@dice 2d4} {@creature druid}s of sapling rank or lower. You are given leave to task these NPCs with specific missions, though any mission you assign must be of relevance to the goals of the order. You may call upon {@dice 1d4} {@creature acolyte}s and a {@creature druid} from among these to assist you directly with a task for the order, but in these situations you are responsible for their safety, and you may be held accountable should anything go wrong."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Autumnal",
                                            "entries": [
                                                "{@italic Prerequisites: Sapling or higher rank in Tenders, and the ability to cast at least 4th-level spells}",
                                                "Your contemplation on the nature of magic has granted you insights which are recognized by your peers. You are now seen as among the wisest and most studious of your order, and you are responsible for utilizing your vast knowledge for the good of Everden.",
                                                "As an autumnal, you are on equal footing with summerblossoms, but where they have committed themselves to practical matters, your responsibilities differ. You have access to the most restricted lore in the archives, and you are charged with ensuring that dangerous objects kept safe by the order do not fall into the wrong hands. You are also appointed to a circle comprised of autumnals who convene regularly to determine the future of your Branch. The decisions made in these meetings are shared with the summerblossoms, and you are expected to offer guidance to a summerblossom whenever it is requested. You are also able to communicate directly with the treekeeper, wherever their journeys have taken them, using a scroll of sending. The treekeeper may not reply immediately, but they welcome your insights and will reply when they are able."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Treekeeper (Special Role)",
                                            "entries": [
                                                "{@italic Prerequisites: Summerblossom or higher rank in Tenders, and must complete a special test (decided by the GM)}",
                                                "Legends say that, in the old times, Tenders who wished to attain the rank of treekeeper would be submitted to a trial in the Scorched Grove to ascertain the purity of their intentions. This title is awarded to only one member of a Branch, and only in rare circumstances where either the previous treekeeper has fallen or when the creation of a new Branch of the Tenders is called for. Having passed a great trial, you have now become the leader of your own Branch. While you donâ€™t have authority to issue directives to other Branches, your position earns you respect among all Tenders as a leader. Your responsibility is not simply to issue instructions to your Branchâ€™s circle of autumnals but also to obtain information which can be shared with them to uphold the natural balance in the region your Branch is sworn to tend. Some Branches, such as the Tenders of the Scorched Grove, use this information to manage and heal a threat to the natural balance, while other Branches must instead keep a vigilant watch for signs of impending danger",
                                                "Treekeepers generally arenâ€™t present as leaders, delegating the bulk of administration to their circle of autumnals. Instead, they work to further the goals of their Branch through their own actions. Some spend their time in contemplation and study, communing with nature, as well as doing research and experimentation. Others journey to uncover lost knowledge, which may help predict threats or find solutions to heal areas scarred by elemental imbalance."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "New Feats",
                            "entries": [
                                "Provided here are a selection of new feats inspired by the Tenders. If using feats in your game, these options are available in addition to those which already exist.",
                                {
                                    "type": "list",
                                    "items": [
                                        "{@feat First Responder|HWKS}",
                                        "{@feat Flamewoken|HWKS}",
                                        "{@feat Forest Sage|HWKS}",
                                        "{@feat Plantmender|HWKS}"
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "New Spells",
                            "entries": [
                                "Add the following spell to the druid, sorcerer, and wizard spell lists.",
                                {
                                    "type": "list",
                                    "items": [
                                        "{@spell Mend Plants|HWKS}"
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "New Character Options",
                            "entries": [
                                {
                                    "type": "entries",
                                    "name": "Circle of the Warden",
                                    "entries": [
                                        "At 2nd level, when choosing a druid circle, the following option is available: Circle of the Warden.",
                                        {
                                            "type": "list",
                                            "items": [
                                                "{@class Druid|phb|Warden|Warden|HWKS}"
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Warlock Patron: The Predator",
                                    "entries": [
                                        "At 1st level, when choosing a warlock patron, the following option is available: The Predator.",
                                        {
                                            "type": "list",
                                            "items": [
                                                "{@class Warlock|phb|Predator|Predator|HWKS}"
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Arcane Tradition: Leyline Magic",
                                    "entries": [
                                        "At 2nd level, when choosing an arcane tradition, the following option is available: Leyline Magic.",
                                        {
                                            "type": "list",
                                            "items": [
                                                "{@class Wizard|phb|Leyline|Leyline|HWKS}"
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "section",
                    "name": "Humblewood Spells, Vol 2",
                    "entries": [
                        {
                            "type": "section",
                            "name": "Spells",
                            "entries": [
                                "",
                                {
                                    "type": "table",
                                    "colLabels": [
                                        "Level",
                                        "Spell",
                                        "School",
                                        "Conc.",
                                        "Ritual",
                                        "Class"
                                    ],
                                    "colStyles": [
                                        "col-1 text-center",
                                        "col-3",
                                        "col-2",
                                        "col-1 text-center",
                                        "col-1 text-center",
                                        "col-5"
                                    ],
                                    "rows": [
                                        [
                                            0,
                                            "{@spell Eat Rocks|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "No",
                                            "Druid, Sorcerer, Warlock, Wizard"
                                        ],
                                        [
                                            0,
                                            "{@spell Elastic Tongue|HWKS}",
                                            "Transmutation",
                                            "No",
                                            "No",
                                            "Druid, Sorcerer, Warlock, Wizard"
                                        ],
                                        [
                                            0,
                                            "{@spell Etheral Claws|HWKS}",
                                            "Evocation",
                                            "No",
                                            "No",
                                            "Druid, Warlock"
                                        ],
                                        [
                                            1,
                                            "{@spell Glinteye|HWKS}",
                                            "Divination",
                                            "No",
                                            "No",
                                            "Bard, Cleric, Sorcerer, Wizard"
                                        ],
                                        [
                                            1,
                                            "{@spell Hearth & Home|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "No",
                                            "Bard, Cleric, Wizard"
                                        ],
                                        [
                                            1,
                                            "{@spell Khaluz's Blessing|HWKS}",
                                            "Evocation",
                                            "Yes",
                                            "No",
                                            "Cleric, Paladin"
                                        ],
                                        [
                                            2,
                                            "{@spell Aether Figment|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "Yes",
                                            "Wizard"
                                        ],
                                        [
                                            2,
                                            "{@spell Bad Berry|HWKS}",
                                            "Transmutation",
                                            "No",
                                            "No",
                                            "Cleric, Druid, Warlock"
                                        ],
                                        [
                                            2,
                                            "{@spell Cairith's Corral|HWKS}",
                                            "Evocation",
                                            "No",
                                            "No",
                                            "Paladin, Ranger"
                                        ],
                                        [
                                            2,
                                            "{@spell Concussive Launch|HWKS}",
                                            "Transmutation",
                                            "No",
                                            "No",
                                            "Sorcerer, Wizard"
                                        ],
                                        [
                                            2,
                                            "{@spell Cymatic Sight|HWKS}",
                                            "Transmutation",
                                            "Yes",
                                            "No",
                                            "CLeric, Druid, Ranger, Sorcerer, Wizard"
                                        ],
                                        [
                                            2,
                                            "{@spell Fall Apart|HWKS}",
                                            "Necromancy",
                                            "Yes",
                                            "No",
                                            "Sorcerer, Warlock, Wizard"
                                        ],
                                        [
                                            2,
                                            "{@spell Fillian's Wind Dance|HWKS}",
                                            "Evocation",
                                            "Yes",
                                            "No",
                                            "Bard, Ranger, Sorcerer"
                                        ],
                                        [
                                            2,
                                            "{@spell Guiding Stars|HWKS}",
                                            "Divination",
                                            "Yes",
                                            "No",
                                            "Cleric, Druid, Paladin, Warlock, Wizard"
                                        ],
                                        [
                                            2,
                                            "{@spell Healing Haze|HWKS}",
                                            "Conjuration",
                                            "Yes",
                                            "No",
                                            "Cleric, Druid"
                                        ],
                                        [
                                            2,
                                            "{@spell Kiss of Witch Hazel|HWKS}",
                                            "Enchantment",
                                            "No",
                                            "No",
                                            "Bard, Druid"
                                        ],
                                        [
                                            2,
                                            "{@spell Nature's Guide|HWKS}",
                                            "Enchantment",
                                            "No",
                                            "No",
                                            "Bard, Druid, Ranger"
                                        ],
                                        [
                                            2,
                                            "{@spell Nettle's Needlework|HWKS}",
                                            "Transmutation",
                                            "No",
                                            "Yes",
                                            "Druid, Sorcerer, Warlock, Wizard"
                                        ],
                                        [
                                            3,
                                            "{@spell Briar Bastion|HWKS}",
                                            "Conjuration",
                                            "Yes",
                                            "No",
                                            "Druid, Ranger"
                                        ],
                                        [
                                            3,
                                            "{@spell Entomb|HWKS}",
                                            "Transmutation",
                                            "Yes",
                                            "No",
                                            "Druid, Sorcerer, Wizard"
                                        ],
                                        [
                                            3,
                                            "{@spell Haunting Echo|HWKS}",
                                            "Illusion",
                                            "No",
                                            "No",
                                            "Bard, Warlock"
                                        ],
                                        [
                                            3,
                                            "{@spell Isolate|HWKS}",
                                            "Illusion",
                                            "No",
                                            "No",
                                            "Cleric, Paladin"
                                        ],
                                        [
                                            3,
                                            "{@spell Metabolise|HWKS}",
                                            "Transmutation",
                                            "Yes",
                                            "No",
                                            "Ranger, Sorcerer, Wizard"
                                        ],
                                        [
                                            3,
                                            "{@spell Rekindle|HWKS}",
                                            "Necromancy",
                                            "Yes",
                                            "No",
                                            "Druid, Sorcerer, Wizard"
                                        ],
                                        [
                                            3,
                                            "{@spell Tangled Growth|HWKS}",
                                            "Abjuration",
                                            "No",
                                            "Yes",
                                            "Druid, Ranger, Wizard"
                                        ],
                                        [
                                            4,
                                            "{@spell Aether Aquatica|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "No",
                                            "Druid, Sorcerer, Wizard"
                                        ],
                                        [
                                            5,
                                            "{@spell Burrow|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "Yes",
                                            "Druid, Ranger, Wizard"
                                        ],
                                        [
                                            6,
                                            "{@spell Enthrall Plant|HWKS}",
                                            "Necromancy",
                                            "Yes",
                                            "No",
                                            "Druid, Warlock"
                                        ],
                                        [
                                            6,
                                            "{@spell Mind Marble|HWKS}",
                                            "Transmutation",
                                            "No",
                                            "Yes",
                                            "Bard, Wizard"
                                        ],
                                        [
                                            7,
                                            "{@spell Wrath of Roots|HWKS}",
                                            "Conjuration",
                                            "No",
                                            "No",
                                            "Sorcerer, Wizard"
                                        ]
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "item": [
        {
            "name": "Antlers of the True Path",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "wondrous": true,
            "entries": [
                "This polished wooden divining rod is a highly valued tool among Cairith's seers. It has been carved into the shape of antlers and scored with delicate filigree.",
                "While holding the divining rod by its two carved antlers, you can spend 10 minutes visualizing a person, place, or object you are familiar with. After this time, the rod to pull you towards your target for as long as you concentrate to maintain the effect. The rod will only pull you towards the person, place, or object if it is within 1,000 feet of you, and on the same plane of existence.",
                "Once you have used this item, it can't be used again until the next dawn."
            ]
        },
        {
            "name": "Belt of the Weald",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This thin chain belt appears to be made of metal, yet closer inspection reveals it to be made up of links of highly polished wood. While wearing this belt you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You roll {@skill Survival} checks with advantage while in a forest environment.",
                        "You ignore difficult terrain while moving through forests.",
                        "You can cast the longstrider spell once, targeting yourself. This property of the belt can't be used again until the next dawn."
                    ]
                }
            ]
        },
        {
            "name": "Cloak of Spines",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This garment is made of large, soft quills that harden while worn. When wearing this cloak, your AC becomes 14 + your Dexterity modifier if you aren't wearing any armor.",
                "If you are hit by a melee attack while wearing the cloak, you can use your reaction to cause the cloak to block the attack and retaliate against the attacker. Reduce the damage of an attack blocked in this way by {@dice 2d4}, and you deal {@dice 2d4} points of magical piercing damage to the attacker. A hedge who uses the cloak to block a melee attack instead reduces the attack's damage by {@dice 4d4} and deals {@dice 4d4} points of magical piercing damage to the attacker. Once used, this property of the cloak can't be used again until the next dawn."
            ]
        },
        {
            "name": "Crown of Daffodils",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "reqAttune": true,
            "wondrous": true,
            "bonusSavingThrow": "+1",
            "entries": [
                "This enchanted laurel crown is woven from leafy, flowering vines which sprout {@dice 1d4} blooming daffodils. As long as the crown has at least one daffodil in bloom while you wear it, you gain a +1 bonus to ability checks and saving throws.",
                "You can remove a daffodil from the crown as an action and bestow it to another creature. The creature can choose to magically affix the given daffodil on their person. The daffodil can become a boutineer, a hair ornament, or corsage. A creature wearing the daffodil or carrying it on their person gains a +1 bonus to ability checks and saving throws for 1 hour, after which the flower withers away.",
                "Each day at dawn {@dice 1d4} daffodils bloom on the crown, up to a maximum of 4 daffodils. Once the last daffodil is removed from the crown, roll a {@dice d20}. On a 1, the crown withers away and is destroyed."
            ]
        },
        {
            "name": "Glowing Ember",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "wondrous": true,
            "weight": 1,
            "entries": [
                "This thick, diamond shaped glass prism contains an ember suspended in its centre. It weighs one pound and feels perpetually warm to the touch. When you speak its command word within 60 feet of it, the ember begins to glow, emanating the light spell. Any creatures within 20 feet of the illuminated prism also feel the ember's heat, and gain resistance to cold damage for as long as the ember glows. Speaking the command word again extinguishes the ember's light.",
                "The prism can be attacked while it is illuminated. The prism is a Tiny object with 30 hit points, AC 16, resistance to non-magical slashing and piercing damage, as well as immunity to fire damage. Once the prism reaches 0 hit points it detonates, dealing {@damage 8d6} fire damage to each creature within 20 feet of it, and is destroyed. Creatures caught in the blast can attempt a DC 13 Dexterity saving throw, taking half damage from the explosion on a success.",
                "You can speak a different command word to cause the prism to float up to 5 feet off the ground. Speaking this command word again causes the prism to stop floating. If you move more than 20 feet from the hovering prism, it follows until it is within 20 feet of you. It takes the shortest path to reach you, avoiding obstacles if possible. If prevented from moving towards you while it is illuminated, the prism begins to emanate even more heat. If unable to reach the creature it is following within 3 rounds, it detonates, as above."
            ]
        },
        {
            "name": "Kwark's Wonderous Kernels",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "wondrous": true,
            "entries": [
                "This ordinary looking velvet pouch contains {@dice 2d4} 1-inch-diameter seeds of various shapes and colors. These bags come in two varieties: a bag of planters, and a bag of tossables. For each seed, the GM rolls a {@dice d8} to determine its type, or chooses its type from one of the lists below.",
                "The bag of planters contains seeds which must be planted. You can use an action to plant a seed in nearby soil. Doing so will cause the listed effect to occur in the space it was planted after 1 minute. Each object created by the seed will wither into organic mush within 1 hour after sprouting from the earth.",
                "The bag of tossables contains seeds which must be thrown. You can use an action to throw a seed up to a range of 20 feet. The listed effect is instantaneous and destroys the seed.",
                {
                    "type": "table",
                    "caption": "Bag of Planters",
                    "colLabels": [
                        "{@dice d8}",
                        "Seed Color, Shape",
                        "Effect"
                    ],
                    "colStyles": [
                        "col-1 text-center",
                        "col-3 text-cemter",
                        "col-8 text-cemter"
                    ],
                    "rows": [
                        [
                            "1",
                            "Black, Round Shaped",
                            "Grows a Large red flower that closes around the first Large or smaller sized creature that enters within 5 feet of the plant for the first time on a turn or starts its turn there. A creature swallowed in this way is restrained, blinded, and has total cover against effects that originate from outside the plant so long as it is inside of it. A swallowed creature can cut their way out by destroying the plant. A swallowed creature is freed once the plant is destroyed. The flower has AC 14 and 30 hit points. It withers away once it is reduced to 0 hit points."
                        ],
                        [
                            "2",
                            "Yellow, Oval Shaped",
                            "A strong root grows from the earth, bearing a removable wooden burl which resembles a stoppered bottle. This functions as an eversmoking bottle, except that the cloud of smoke it produces is yellow and smells strongly of mustard."
                        ],
                        [
                            "3",
                            "Brown, Tear Shaped",
                            "A small tree grows from the spot the seed was planted. It has 1d4+1 red fruits hanging from its branches. The fruit can be eaten as an action and provides the benefit of a potion of healing. The fruits last until consumed or until their duration expires."
                        ],
                        [
                            "4",
                            "Orange, Tear Shaped",
                            "A sturdy sapling sprouts from the earth. One of its branches is longer than the others and can be easily removed. This branch can be commanded to glow or stop glowing by anyone holding it. It sheds bright orange light in a 60-foot-radius, and dim light in a 60-foot-radius beyond this."
                        ],
                        [
                            "5",
                            "Red, Round Shaped",
                            "A single wooden shaft grows from the earth, and then ignites. This magical torch can be removed and wielded. It sheds bright red light in a 30-foot-radius and dim light in a 30-foot-radius beyond this. You can make attacks with this torch as though it were a club. Any creature hit takes an additional 2d6 fire damage and must make a DC 13 Dexterity saving throw or catch fire. A creature that is on fire takes 1d6 fire damage at the start of their turn, and can repeat the saving throw using an action, ending the effect on a success. The torch cannot be extinguished except by magical means."
                        ],
                        [
                            "6",
                            "Russet, Oval Shaped",
                            "A hollow shell resembling a large ovular seed sprouts from the earth. This shell splits down the middle into two halves. Each half can be taken and wielded as a standard shield. Anyone wielding one of these shields has resistance to fire damage."
                        ],
                        [
                            "7",
                            "Green, Heart Shaped",
                            "A gnarled staff sprouts from the earth, covered in ivy and fruit-bearing grapevines. The staff can be taken and wielded as a quarterstaff. Treat this weapon as though it were under the effect of a shillelagh spell for as long as the staff exists."
                        ],
                        [
                            "8",
                            "Purple, Tear Shaped",
                            "The seed grows into a Huge mushroom with a wooden door in its side, and a small stone chimney rising from its cap. Inside, there is a stone hearth and five soft cushions. The person who planted the seed can issue a mental command at any time to lock or unlock the door."
                        ]
                    ]
                },
                {
                    "type": "table",
                    "caption": "Bag of Tossables",
                    "colLabels": [
                        "{@dice d8}",
                        "Seed Color, Shape",
                        "Effect"
                    ],
                    "colStyles": [
                        "col-1 text-center",
                        "col-3 text-cemter",
                        "col-8 text-cemter"
                    ],
                    "rows": [
                        [
                            "1",
                            "Black, Round Shaped",
                            "The seed explodes into a haze of blue pollen. Each creature within 10 feet must make a DC 13 Constitution saving throw or fall asleep. A sleeping creature can be woken using an action, or by dealing 1 point of damage to them. Otherwise they will wake up in 1 minute."
                        ],
                        [
                            "2",
                            "Yellow, Oval Shaped",
                            "The seed bursts, unleashing a 10-foot-radius cloud of pungent yellow gas which lasts for 1 minute. The effect is otherwise identical to a stinking cloud spell (save DC 14). "
                        ],
                        [
                            "3",
                            "Brown, Tear Shaped",
                            "The seed unleashes a burst of gentle, green radiance. Each creature within 10 feet gains 2d4+2 temporary hit points."
                        ],
                        [
                            "4",
                            "Orange, Tear Shaped",
                            "The seed erupts, releasing a cascade of orange acid. Each creature within 10 feet must succeed on a DC 14 Dexterity saving throw or take 2d8 acid damage."
                        ],
                        [
                            "5",
                            "Red, Round Shaped",
                            "The seed explodes in flames. Each creature within 10 feet must make a DC 14 Dexterity saving throw, taking 5d6 fire damage on a failure and half as much on a success."
                        ],
                        [
                            "6",
                            "Russet, Oval Shaped",
                            "The seed pops, unleashing a cloud of small brown burrs. Each creature within 10 feet becomes coated with them, and gains vulnerability to fire damage for 1 minute."
                        ],
                        [
                            "7",
                            "Green, Heart Shaped",
                            "The seed bursts, unleashing a cloud of floral pink mist. Each creature within 10 feet must make a DC 14 Wisdom saving throw or become incapable of attacking or taking hostile actions for 1 minute. A creature affected in this way can attempt the saving throw again on each of its turns, ending the effect on a success. The effect ends immediately if the creature is attacked."
                        ],
                        [
                            "8",
                            "Purple, Tear Shaped",
                            "The seed shatters into a haze of befuddling spores. Each creature within 5 feet must succeed on a DC 14 Constitution saving throw. On a failure, they are confused as the confusion spell, and must determine their actions randomly at the beginning of each of their turns. At the end of their turn, the target can repeat the saving throw, ending the effect on a success."
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Marotte of Chance",
            "source": "HWKS",
            "page": 0,
            "type": "RD",
            "rarity": "uncommon",
            "reqAttune": "by a luma",
            "entries": [
                "This rather unassuming marotte has been imbued with the magic of fate, specific to the Amaranthine Clhuran. Luma can tap into this force to cause it to unleash a plethora of magical effects.",
                "This marotte can be used as an arcane focus for your spells. Additionally, you can use this marotte to make melee attacks. These attacks are calculated using your Charisma modifier + your proficiency bonus. Attacks made with the marotte deal {@damage 1d4} + your Charisma modifier bludgeoning damage. Each time you hit with this weapon, there is a 10% chance something odd happens. If it does, roll on the Chance Table to determine any additional effects that occur. The attack still deals damage as normal, unless otherwise specified.",
                {
                    "type": "table",
                    "caption": "Chance Table",
                    "colLabels": [
                        "{@dice d10}",
                        "Effect"
                    ],
                    "colStyles": [
                        "col-1 text-center",
                        "col-8 text-cemter"
                    ],
                    "rows": [
                        [
                            "1",
                            "The attack deals no damage and emits a clear, resonant squeak, audible out to 100 feet."
                        ],
                        [
                            "2",
                            "A bouquet of sweet-smelling flowers springs from the head of the marotte. Your attack deals no damage, and the target of your attack must succeed on a DC 13 Wisdom saving throw or become charmed by you for 1 minute. The charmed effect ends the moment you or one of your allies takes hostile actions against the target."
                        ],
                        [
                            "3",
                            "You and the target of your attack immediately switch places. This is a teleportation effect, which emits an audible pop."
                        ],
                        [
                            "4",
                            "Magical lightning arcs from the marotte toward the target of your attack. The target takes 2d6 points of lightning damage, and each creature within 10 feet of your target (including you) must succeed on a DC 13 Dexterity saving throw or take 1d6 points of lightning damage."
                        ],
                        [
                            "5",
                            "The target of your attack is affected by an enlarge/ reduce spell (save DC 13). Roll again. On an even number the target is enlarged, on an odd number they are reduced."
                        ],
                        [
                            "6",
                            "The marotte transforms into an axe. The attack deals 1d12 + your Charisma modifier slashing damage instead of what it would deal normally. The target of your attack must succeed on a DC 14 Wisdom saving throw or become frightened of you for 1 minute. A frightened creature can attempt a new saving throw at the end of its turn, ending the effect on a success."
                        ],
                        [
                            "7",
                            "The target of your attack glows the color of your choice. Until the start of your next turn, they shed bright light of out to 15 feet, and dim light an additional 15 feet beyond this."
                        ],
                        [
                            "8",
                            "You turn invisible for 1 minute. Roll again. On an odd number the target of your attack also becomes invisible for 1 minute."
                        ],
                        [
                            "9",
                            "Your attack deals no damage.The target of your attack must succeed on a DC 14 Wisdom saving throw or turn into a frog (as the polymorph spell) for 1 minute. Roll again. On a roll of 1, the effect happens again, targeting you."
                        ],
                        [
                            "10",
                            "Roll twice more on this table, re-rolling 10s. Your attack has both of the effects you rolled combined."
                        ]
                    ]
                }
            ]
        },
        {
            "name": "Ring of Plant-Speech",
            "source": "HWKS",
            "page": 0,
            "type": "RG",
            "rarity": "uncommon",
            "entries": [
                "While wearing this ring you can speak with plants and plant creatures within 30 feet of you as though you shared a common language. Non-sentient plants within 30 feet of you gain sentience and can communicate with you telepathically, relating any events they have seen within the last day, along with information about creatures that have passed, weather, and other circumstances.",
                "This ring is prized by followers of Henwin."
            ]
        },
        {
            "name": "Staff of Climbing Ivy",
            "source": "HWKS",
            "page": 0,
            "srd": true,
            "type": "M",
            "rarity": "uncommon",
            "reqAttune": "by a bard, druid, sorcerer",
            "weight": 4,
            "weaponCategory": "simple",
            "property": [
                "V"
            ],
            "dmg1": "1d6",
            "dmgType": "B",
            "dmg2": "1d8",
            "staff": true,
            "entries": [
                "or warlock)",
                "This staff appears to be formed by several strands of leafy vines that have grown together into the shape of a twisted walking stick. Despite this, it is as rigid and sturdy as one made from wood.",
                "The staff has three command words, each of which can be spoken while holding the staff to cause a different effect:",
                "You can speak the first command word as a bonus action to cause up to 120 feet of creeping vines to grow from the staff at a speed of 30 feet per round toward a solid surface or unattended object you can see.",
                "You can speak the second command word (costing no action) to cause the vines to grow into a solid surface or unattended object within their reach and become firmly affixed. The vines can only be anchored to one object or surface at a time.",
                "You can speak the third command word as an action to cause the vines to retract into the staff at a speed of 30 feet per round. If anchored to a solid surface, they will pull the staff' wielder towards it at the same speed. If anchored to an unattended object, they will pull the object towards the wielder of the staff instead.",
                "When the vines are extended, they can be attacked. They have an Armor Class of 14, 45 hit points, and vulnerability to fire and slashing damage. The vines have a Strength score of 16 and can bear up to 240 pounds of weight at once. Weight in excess of this will cause the vines to begin to tear, dealing 10 points of damage to them each round. If the vines drop to 0 hit points the staff is destroyed. Otherwise, the vines regain all lost hit points when they retract into the staff."
            ]
        },
        {
            "name": "Talons of the Squall",
            "source": "HWKS",
            "page": 0,
            "rarity": "uncommon",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "Awarded to those who pass tests of endurance administered by priests of Altus, these leg-bracers seem to crackle with a faint energy. While you wear them, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have resistance to lightning damage.",
                        "You roll all saving throws and ability checks made to resist being moved by strong winds with advantage.",
                        "You do not suffer disadvantage on ranged attack rolls or {@skill Perception} checks while in strong winds or under conditions of heavy rain or snowfall. If you possess a fly speed, you can fly normally under such conditions."
                    ]
                }
            ]
        },
        {
            "name": "Band of Fruitfulness",
            "source": "HWKS",
            "page": 0,
            "rarity": "rare",
            "wondrous": true,
            "recharge": "dawn",
            "charges": 6,
            "entries": [
                "This gold bangle is etched with depictions of fruits, vegetables, and prepared foods. This item has 6 charges. You can speak the command word and expend 1 to 6 charges to cause the bangle to fly from your wrist and transform into a gold table filled with fresh and lovingly crafted home-cooked dishes. This food never goes bad or spoils, nor does it empty until the effect's duration expires. The feast created by the bangle takes 10 minutes to consume for each charge expended to activate it.",
                "Up to 5 creatures can sit at the table and spend the full duration feasting to gain the following benefits based on how many charges were spent to activate the bangle. 1 charge: Each creature heals {@dice 5d8} hit points 2 charges: As above, and each creature becomes immune to poison and fear for 1 hour 3 charges: As above, and each creature is cured of all diseases and poisons currently affecting them 4 charges: As above, and each creature has their {@condition exhaustion} level reduced by 1 5 charges: As above, and each creature's hit point maximum increases by {@dice 2d10} for 1 hour. Each creature gains this many hit points. 6 charges: As above, but {@condition exhaustion} is reduced by a further level, and all the benefits which last for 1 hour last for 24 hours instead.",
                "Each time the item is used, it appears to have less and less etchings of food covering its surface. Once all it's charges have run out, it resembles a plain gold bangle. The bracelet regains 2 charges each day at dawn, up to a maximum of 6 charges.",
                "This item is valued by followers of Hanera."
            ]
        },
        {
            "name": "The Chronicles of Fools",
            "source": "HWKS",
            "page": 0,
            "rarity": "rare",
            "reqAttune": true,
            "wondrous": true,
            "curse": true,
            "entries": [
                "A poorly-bound leather journal, filled with stories from countless adventurers and chroniclers, spanning centuries. The book perpetually has blank pages that hunger for more stories. The cover is indestructible, and if the pages are damaged or removed they will simply re-form a few minutes later. The writing on the pages can't be obscured, smudged, or altered in any way. Only those attuned to the book can write in it. At anytime, you can consult the stories within, as an action, to grant yourself or a person who can hear you advantage on any ability check. The target also adds double their proficiency bonus to this check.",
                {
                    "type": "entries",
                    "name": "Curse",
                    "entries": [
                        "You are reluctant to part with the chronicle for as long as you remain attuned to it, and are compelled to keep the journal on you at all times. Some force inside the book urges you to write detailed entries about anything that happens in your life, including intimate details about you, your friends, and anything of note you may have come across while attuned to the book. The book compels you to write in total honesty, and to divulge vulnerabilities, flaws, and even damaging secrets in your entries."
                    ]
                }
            ]
        },
        {
            "name": "Cogwork Wings",
            "source": "HWKS",
            "page": 0,
            "rarity": "rare",
            "wondrous": true,
            "entries": [
                "This strange device was made by a mapach tinkerer and uses its powerful enchantment as a power supply. It resembles two folded wings, made of brass and cloth, attached to a box containing an intricate array of gears and cogs. This box has leather straps which allow it to be worn across the back, and two brass levers which can be cranked by the wearer. The entire device weighs only 20 lbs. While wearing the device, you can crank the left lever using an action to activate the wings, causing them unfurl and flap. Cranking the left lever again as an action stops the wings movement and causes them to fold back into their original position.",
                "While the wings are in motion, you have a fly speed of 60 feet. This fly speed is reduced to 30 feet if your combined weight, with your gear (worn and carried), is over 150 lbs. If your combined weight, with your gear, is over 250 lbs, you can't use this item to fly. Once activated, the wings will function until you stop their motion by cranking the left lever again. You can use the device to fly for up to 1 hour, all at once or in several shorter flights, each one reducing the duration by a minimum of 1 minute. If you are flying when the duration expires, you fall to the ground, taking damage as normal.",
                "You can crank the right lever as a reaction to cause the wings to extend out to the sides, allowing you to glide safely to the earth. Cranking it a second time as a reaction causes the wings to fold back into their original position. If you are falling while the wings are extended in this way, you immediately stop falling and descend at a rate of 30 feet per round until you land. This speed is increased to 60 feet if your combined weight with your gear (worn and carried) is over 150 lbs. Using this lever doesn't count towards the flight duration, however if it is cranked while the wings are in motion it will still slow your fall, though there is a 50 percent chance the device will fail. If this occurs the device will become completely useless for {@dice 2d12} hours after you've landed.",
                "The wings regain 10 minutes of their flying capability for every 4 hours they aren't in use."
            ]
        },
        {
            "name": "Eye of Starsight",
            "source": "HWKS",
            "page": 0,
            "rarity": "rare",
            "reqAttune": true,
            "recharge": "dusk",
            "wondrous": true,
            "charges": 3,
            "entries": [
                "This black bronze amulet is made of intricate cogwork and has a single polished glass orb the size of an eye set tightly in its center. This item has 3 charges, and regains {@dice 1d3} charges each night at dusk.",
                "When you wear this amulet, the orb inside grants you supernatural awareness of your surroundings. When you make a skill check, attack roll, or saving throw, you can spend your reaction and expend a charge to re-roll the result. You must do this after the die has been rolled, but before the outcome has been determined. You must also take the result of the new roll, even if it is worse than the original.",
                "Additionally, speaking a command word causes the cogwork around the glass orb to open slightly, allowing the orb to be removed. Speaking the command word again closes it. While the amulet is open, you can use your bonus action to command the orb to float out of its setting, or return back to a resting state. While as the orb is out, you can spend an action to move it up to 30 feet in any direction, and you can expend a single charge to mentally receive visual information from the orb for 10 minutes. The orb has {@sense truesight} out to 30 feet and can see in all directions at once. There is no limit to how far away from you the orb can move, but it can't enter another plane of existence. The orb's movement can be blocked by a solid barrier, but it can pass through an opening as small as 1 inch in diameter. While the orb is out of the amulet, the first property of this item can't be used."
            ]
        },
        {
            "name": "Fangs of Guile",
            "source": "HWKS",
            "page": 0,
            "rarity": "rare",
            "reqAttune": true,
            "wondrous": true,
            "recharge": "dusk",
            "charges": 3,
            "entries": [
                "This rare necklace was created by supplicants of Kren, who obtained knowledge of their craft in a ritual exchange. The necklace imbues its wearer with equal parts guile and savagery.",
                "While you wear it, you make {@skill Deception}, {@skill Insight}, and {@skill Persuasion} skill checks with advantage.",
                "This item has 3 charges. It regains {@dice 1d3} charges nightly, at dusk. You can spend an action to expend 1 to 3 charges and cause a large red spectral maw to bite a creature you can see within 5 feet of you. The spectral jaws make an attack roll with a +7 bonus. On a hit, the target takes {@dice 3d6} magical piercing damage for each charge spent. You gain an amount of temporary hit points equal to the damage dealt.",
                "If the necklace has no charges at dusk, roll {@dice 1d6}. On a 1 the fangs yellow and dull, and the item loses its magic forever."
            ]
        },
        {
            "name": "Ring of the Sky Hunter",
            "source": "HWKS",
            "page": 0,
            "type": "RG",
            "rarity": "rare",
            "reqAttune": true,
            "recharge": "dawn",
            "charges": 3,
            "entries": [
                "This ring has 3 charges, and it regains {@dice 1d3} spent charges each day at dawn. While wearing this ring, you can use an action and expend 1 to 3 of its charges to attack one creature you can see within 60 feet of you. The ring produces a pair of spectral talons which dive from the sky and make an attack roll with a +7 bonus. On a hit, the target takes {@dice 2d8} magical piercing damage for each charge you spent.",
                "Alternatively, you can expend 1 to 3 of the ring's charges as an action to cause the same spectral talons to appear and lift a Large or smaller creature you can see within 60 feet of you. The target must succeed on a DC 15 Strength saving throw or be {@condition grappled} by the claws and lifted 20 feet into the air for each charge spent. The target can repeat the saving throw at the end of each of its turns to break free of the grapple, and takes damage as normal from its fall."
            ]
        },
        {
            "name": "Pathfinder's Pebble",
            "source": "HWKS",
            "page": 0,
            "rarity": "very rare",
            "reqAttune": "by a cleric of the nature domain, druid, or ranger",
            "wondrous": true,
            "entries": [
                "This polished pebble is inscribed with the holy symbol of Reya, and carries a powerful blessing from the Amaranthine. So long as you carry the pebble on your person, and are outdoors, you always know which way is north.",
                "When holding the stone, you can spend an action to focus your mind on your surroundings, allowing you to cast commune with nature once. You regain the ability to do so each dawn. Additionally, by grasping the pebble tightly and speaking out loud the name of a fixed location you are familiar with on the same plane of existence, the pebble will grant you knowledge of the shortest, most direct physical path toward it. As long as you are holding the pebble, you know how far the named location is from you and in what direction it lies. Furthermore, you can automatically determine which path is the shortest and most direct route (but not necessarily the safest route) to the destination. This lasts until you have either arrived at your destination, or select a new destination in the same manner described above."
            ]
        },
        {
            "name": "Feather Robe",
            "source": "HWKS",
            "page": 0,
            "rarity": "very rare",
            "reqAttune": "by a sorcerer, warlock, or wizard",
            "wondrous": true,
            "bonusSavingThrow": "+1",
            "entries": [
                "This luxuriant robe is made from the feather of a birdfolk spellcaster. Though it appears to be made of many individual plumes, the robe is actually composed of only a single feather, flawlessly copied over and over again by the magic which created it.",
                "You gain the following benefits from wearing the robe.",
                {
                    "type": "list",
                    "items": [
                        "Your Intelligence or Charisma score becomes 22 (your choice when you don the robe).",
                        "You have a +1 bonus to saving throws while you wear this robe."
                    ]
                },
                "Additionally, you gain different benefits from wearing the robe depending on the race of the birdfolk spellcaster that donated a feather to create it. The GM chooses the feather that was used to make the robe or rolls to determine it randomly. ",
                {
                    "type": "table",
                    "colLabels": [
                        "{@dice d10}",
                        "Birdfolk Feather"
                    ],
                    "colStyles": [
                        "col-2 text-center",
                        "col-10 text-center "
                    ],
                    "rows": [
                        [
                            "1-2",
                            "Corvum"
                        ],
                        [
                            "3-4",
                            "Gallus"
                        ],
                        [
                            "5-6",
                            "Luma"
                        ],
                        [
                            "7-8",
                            "Raptor"
                        ],
                        [
                            "9-10",
                            "Strig"
                        ]
                    ],
                    "footnotes": [
                        "Optional Footer"
                    ]
                },
                {
                    "type": "entries",
                    "name": "",
                    "entries": [
                        "{@bold Corvum}: Your spell attacks have advantage against foes that have not yet acted this combat. Treat any successful spell attack roll made against a surprised creature as though it were a critical hit.",
                        "{@bold Gallus}: When you cast a spell that targets only one ally and doesn't have a range of self, you can target a second ally in range with the same spell. You can only use this property three times each day.",
                        "{@bold Luma}: Whenever a target succeeds on a saving throw against one of your spells, you may spend your reaction to have that target repeat that saving throw. If the target fails, they suffer the consequences for failing the saving throw of your initial spell as normal. You can only use this property three times each day.",
                        "{@bold Raptor}: When casting a spell that deals damage to a single target, so long as you have already expended some of your movement during that turn, your spell deals additional damage equal to your character level.",
                        "{@bold Strig}: Whenever you cast a spell you gain temporary hit points equal to {@dice 2d10} + the level of the spell slot used to cast it."
                    ]
                }
            ]
        },
        {
            "name": "Flame of Ingenuity",
            "source": "HWKS",
            "page": 0,
            "rarity": "very rare",
            "reqAttune": "by a bard, sorcerer, or wizard",
            "wondrous": true,
            "entries": [
                "This wooden lantern contains a small flame within. The first instance of such an item was said to have been based on a divine vision inspired by Gesme herself, and represents the true power of fire's gift when properly harnessed.",
                "The mystical flame inside this wooden lantern never goes out, and can only be quenched inside of an antimagic field. It sheds bright light in a 30-foot-radius, and dim light for an additional 30 feet. Invisible creatures and objects are visible so long as they are in the lantern's bright light, and illusions in the bright light are immediately revealed, appearing as spectral forms rather than solid matter. You can use an action to speak a command word, reducing the flame's light to dim light in a 5-foot-radius.",
                "When you roll a 1 or 2 on an Intelligence check while you are attuned to the lantern, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2.",
                "Additionally, by spending 1 minute meditating on the flame within the lantern, you can regain up to 5 levels worth of spell slots, divided as you choose. For example, you could regain one 5th level spell slot, or one 3rd level and one 2nd level spell slot. This property can't be used again until the next dawn."
            ]
        },
        {
            "name": "Egg of Rebirth",
            "source": "HWKS",
            "page": 0,
            "rarity": "legendary",
            "reqAttune": true,
            "wondrous": true,
            "entries": [
                "This smooth golden egg fits in your hand. It feels warm and is surprisingly strong despite its delicate appearance. It is blessed with the life giving powers of Ardea. Attuning to the egg involves placing a portion of your life energy inside of it. You can feel your life force within it, and always know its direction and distance from you as long as you are on the same plane of existence as the egg. The egg is unbreakable and indestructible. Only a power word kill spell cast on the egg can destroy it, causing it to turn black and crumble to dust and killing any attuned character in the process, regardless of their hit point total.",
                "While you carry this egg on your person you may spend your reaction to immediately attempt a second saving throw against one effect or condition currently affecting you. Once you use this property you can't use it again until the next dawn.",
                "When you die, as long as the egg is within 20 feet of you, it shatters and you are immediately restored to life (regaining your maximum hit points) in a blaze of brilliant light. All hostile creatures within 60 feet of you must succeed on a DC 17 Constitution saving throw, taking {@damage 12d6} radiant damage on a failure, or half as much on a success. Any creature that fails the saving throw is {@condition blinded} for 1 minute."
            ]
        },
        {
            "name": "Shroud of Ending",
            "source": "HWKS",
            "page": 0,
            "rarity": "artifact",
            "reqAttune": true,
            "wondrous": true,
            "bonusAc": "+2",
            "bonusSavingThrow": "+2",
            "entries": [
                "There is an old tale about a foolish birdfolk sage who believed themselves to be even wiser than the Amaranthine. One day, while wandering alone in the Wood at night, they met Tyton, who had come to collect their soul. Rather than accept their death with dignity, the sage instead debated with Tyton about the unfairness of mortality. Tyton could not deny their logic, but warned the heedless sage about disrupting the cycle of life and death. He wove for the sage a cloak from the fabric of the night sky itself and infused it with a small fraction of his power. With this, the sage could live forever. Tyton declared that he would return in a century, and if the sage still felt the same, the Amaranthine of death would never again visit the sage. The sage watched everyone around them gradually age, succumbing to illness and old age as he lived on, and eventually understood his folly. It is said that Tyton left the Shroud of Ending in the world as a reminder of the sage's foolishness.",
                "You must make a DC 12 Constitution saving throw when you attune to this artifact. On a failure, the Shroud of Ending causes you to magically age {@dice 5d10} years. For the next hour, you make any attack roll, ability check, or saving throw with disadvantage as your body is temporarily weakened by your sudden advance in age. If this causes you to age beyond the average natural lifespan for your race, you instantly die and your soul rises immediately as a ghost sworn to protect the artifact. As long as you are attuned to this artifact, you deal {@damage 1d6} necrotic damage to any plant you touch that isn't a creature, and any creatures with the plant or beast type within 30 feet of you become hostile toward you. Additionally, you stop aging and no longer require food or sleep to live. Whenever you are no longer attuned to this item you immediately age a number of years equal to the amount of time you would have aged while attuned to the artifact. If this causes you to age beyond the average natural lifespan for your race, you instantly die.",
                {
                    "type": "entries",
                    "name": "Blessings of Tyton",
                    "entries": [
                        "While wearing the cloak you gain the following benefits:",
                        {
                            "type": "list",
                            "items": [
                                "You gain a +2 bonus to your AC and saving throws.",
                                "You can see in darkness as if it were bright light.",
                                "You are immune to poison damage, the {@condition poisoned} condition, and all diseases."
                            ]
                        },
                        "You make death saving throw, and saving throws against effects that would kill you instantaneously without dealing damage with advantage."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Hasten the Sunset",
                    "entries": [
                        "While wearing the cloak, you can spend an action to cause a living creature you can see within 120 feet of you to age rapidly. The creature must make a DC 17 Constitution saving throw, instantly aging {@dice 6d10} years on a failure and aging by one year on a success. On a failed saving throw, the target automatically fails any Strength or Dexterity checks and makes all other attack rolls, ability checks, and saving throws with disadvantage. This effect lasts until a remove curse spell is cast on the target to dispel it. If the target ages over the average natural lifespan for their race, they die. Once this property has been used, it can't be used again until a week has passed."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Shade's Form",
                    "entries": [
                        "While wearing the cloak, you can cast etherealness. Once this property has been used, it can't be used again until the next dusk."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Step of the Night's Shadow",
                    "entries": [
                        "While wearing the cloak, you gain the ability to teleport to a location within an area of dim light or darkness within 500 feet of you as an action. You arrive at exactly the spot desired, so long as it is an area of dim light or darkness. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45- degree angle, 300 feet.\" In order for the teleportation to succeed, you must arrive in an area of dim light or darkness, otherwise you are teleported to the nearest such area within range. You can bring along objects as long as their weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell. If you would arrive in a place already occupied by an object or a creature, you and any creatures or objects you wished to bring with you fail to teleport. After you use this property roll {@dice 1d6}. On a roll of 6 you can't use it again until the next dusk."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Destroying the Cloak",
                    "entries": [
                        "The only way to destroy the Shroud of Ending is to present it to the rising sun in the hands of a Cleric of Ardea of at least 17th level. The cleric must say a prayer, returning the power of night and death to Tyton, and cast the daylight spell upon it. The power within the Shroud of Ending will recognize the coming of Ardea's dawn and return to Tyton's realm. A faintly magical, but powerless cloak will be left behind, which resembles the sky at dusk."
                    ]
                }
            ]
        },
        {
            "name": "Saber of Unity (Rapier)",
            "source": "HWKS",
            "baseItem": "rapier|PHB",
            "type": "M",
            "rarity": "very rare",
            "reqAttune": true,
            "weight": 2,
            "weaponCategory": "martial",
            "property": [
                "F"
            ],
            "dmg1": "1d8",
            "dmgType": "P",
            "bonusWeapon": "+2",
            "sword": true,
            "weapon": true,
            "entries": [
                "This sword has been imbued with the spirit of Gaspard's leadership, and grants whoever wields it a portion of his courage. You gain a +2 bonus to attack and damage rolls made with this magic sword. In addition, you and any allies within 10 feet of you are immune to being {@condition frightened} while you wield it. Whenever you score a critical hit with this sword against a foe that is larger than you, you and all allies within 10 feet of you gain {@dice 2d10} temporary hit points."
            ]
        },
        {
            "name": "Saber of Unity (Scimitar)",
            "source": "HWKS",
            "baseItem": "scimitar|PHB",
            "type": "M",
            "rarity": "very rare",
            "reqAttune": true,
            "weight": 3,
            "weaponCategory": "martial",
            "property": [
                "F",
                "L"
            ],
            "dmg1": "1d6",
            "dmgType": "S",
            "bonusWeapon": "+2",
            "sword": true,
            "weapon": true,
            "entries": [
                "This sword has been imbued with the spirit of Gaspard's leadership, and grants whoever wields it a portion of his courage. You gain a +2 bonus to attack and damage rolls made with this magic sword. In addition, you and any allies within 10 feet of you are immune to being {@condition frightened} while you wield it. Whenever you score a critical hit with this sword against a foe that is larger than you, you and all allies within 10 feet of you gain {@dice 2d10} temporary hit points."
            ]
        }
    ],
    "itemGroup": [
        {
            "name": "Saber of Unity",
            "source": "HWKS",
            "type": "GV",
            "rarity": "very rare",
            "reqAttune": true,
            "items": [
                "Saber of Unity (Rapier)|HWKS",
                "Saber of Unity (Scimitar)|HWKS"
            ]
        }
    ],
    "table": [
        {
            "name": "Kwark's Wondrous Kernels - Bag of Planters",
            "source": "HWKS",
            "colLabels": [
                "{@dice d8}",
                "Seed Color, Shape",
                "Effect"
            ],
            "colStyles": [
                "col-1 text-center",
                "col-3 text-cemter",
                "col-8 text-cemter"
            ],
            "rows": [
                [
                    "1",
                    "Black, Round Shaped",
                    "Grows a Large red flower that closes around the first Large or smaller sized creature that enters within 5 feet of the plant for the first time on a turn or starts its turn there. A creature swallowed in this way is restrained, blinded, and has total cover against effects that originate from outside the plant so long as it is inside of it. A swallowed creature can cut their way out by destroying the plant. A swallowed creature is freed once the plant is destroyed. The flower has AC 14 and 30 hit points. It withers away once it is reduced to 0 hit points."
                ],
                [
                    "2",
                    "Yellow, Oval Shaped",
                    "A strong root grows from the earth, bearing a removable wooden burl which resembles a stoppered bottle. This functions as an eversmoking bottle, except that the cloud of smoke it produces is yellow and smells strongly of mustard."
                ],
                [
                    "3",
                    "Brown, Tear Shaped",
                    "A small tree grows from the spot the seed was planted. It has 1d4+1 red fruits hanging from its branches. The fruit can be eaten as an action and provides the benefit of a potion of healing. The fruits last until consumed or until their duration expires."
                ],
                [
                    "4",
                    "Orange, Tear Shaped",
                    "A sturdy sapling sprouts from the earth. One of its branches is longer than the others and can be easily removed. This branch can be commanded to glow or stop glowing by anyone holding it. It sheds bright orange light in a 60-foot-radius, and dim light in a 60-foot-radius beyond this."
                ],
                [
                    "5",
                    "Red, Round Shaped",
                    "A single wooden shaft grows from the earth, and then ignites. This magical torch can be removed and wielded. It sheds bright red light in a 30-foot-radius and dim light in a 30-foot-radius beyond this. You can make attacks with this torch as though it were a club. Any creature hit takes an additional 2d6 fire damage and must make a DC 13 Dexterity saving throw or catch fire. A creature that is on fire takes 1d6 fire damage at the start of their turn, and can repeat the saving throw using an action, ending the effect on a success. The torch cannot be extinguished except by magical means."
                ],
                [
                    "6",
                    "Russet, Oval Shaped",
                    "A hollow shell resembling a large ovular seed sprouts from the earth. This shell splits down the middle into two halves. Each half can be taken and wielded as a standard shield. Anyone wielding one of these shields has resistance to fire damage."
                ],
                [
                    "7",
                    "Green, Heart Shaped",
                    "A gnarled staff sprouts from the earth, covered in ivy and fruit-bearing grapevines. The staff can be taken and wielded as a quarterstaff. Treat this weapon as though it were under the effect of a shillelagh spell for as long as the staff exists."
                ],
                [
                    "8",
                    "Purple, Tear Shaped",
                    "The seed grows into a Huge mushroom with a wooden door in its side, and a small stone chimney rising from its cap. Inside, there is a stone hearth and five soft cushions. The person who planted the seed can issue a mental command at any time to lock or unlock the door."
                ]
            ]
        },
        {
            "name": "Kwark's Wondrous Kernels - Bag of Tossables",
            "source": "HWKS",
            "colLabels": [
                "{@dice d8}",
                "Seed Color, Shape",
                "Effect"
            ],
            "colStyles": [
                "col-1 text-center",
                "col-3 text-cemter",
                "col-8 text-cemter"
            ],
            "rows": [
                [
                    "1",
                    "Black, Round Shaped",
                    "The seed explodes into a haze of blue pollen. Each creature within 10 feet must make a DC 13 Constitution saving throw or fall asleep. A sleeping creature can be woken using an action, or by dealing 1 point of damage to them. Otherwise they will wake up in 1 minute."
                ],
                [
                    "2",
                    "Yellow, Oval Shaped",
                    "The seed bursts, unleashing a 10-foot-radius cloud of pungent yellow gas which lasts for 1 minute. The effect is otherwise identical to a stinking cloud spell (save DC 14). "
                ],
                [
                    "3",
                    "Brown, Tear Shaped",
                    "The seed unleashes a burst of gentle, green radiance. Each creature within 10 feet gains 2d4+2 temporary hit points."
                ],
                [
                    "4",
                    "Orange, Tear Shaped",
                    "The seed erupts, releasing a cascade of orange acid. Each creature within 10 feet must succeed on a DC 14 Dexterity saving throw or take 2d8 acid damage."
                ],
                [
                    "5",
                    "Red, Round Shaped",
                    "The seed explodes in flames. Each creature within 10 feet must make a DC 14 Dexterity saving throw, taking 5d6 fire damage on a failure and half as much on a success."
                ],
                [
                    "6",
                    "Russet, Oval Shaped",
                    "The seed pops, unleashing a cloud of small brown burrs. Each creature within 10 feet becomes coated with them, and gains vulnerability to fire damage for 1 minute."
                ],
                [
                    "7",
                    "Green, Heart Shaped",
                    "The seed bursts, unleashing a cloud of floral pink mist. Each creature within 10 feet must make a DC 14 Wisdom saving throw or become incapable of attacking or taking hostile actions for 1 minute. A creature affected in this way can attempt the saving throw again on each of its turns, ending the effect on a success. The effect ends immediately if the creature is attacked."
                ],
                [
                    "8",
                    "Purple, Tear Shaped",
                    "The seed shatters into a haze of befuddling spores. Each creature within 5 feet must succeed on a DC 14 Constitution saving throw. On a failure, they are confused as the confusion spell, and must determine their actions randomly at the beginning of each of their turns. At the end of their turn, the target can repeat the saving throw, ending the effect on a success."
                ]
            ]
        },
        {
            "name": "Marotte of Chance",
            "source": "HWKS",
            "colLabels": [
                "{@dice d10}",
                "Effect"
            ],
            "colStyles": [
                "col-1 text-center",
                "col-8 text-cemter"
            ],
            "rows": [
                [
                    "1",
                    "The attack deals no damage and emits a clear, resonant squeak, audible out to 100 feet."
                ],
                [
                    "2",
                    "A bouquet of sweet-smelling flowers springs from the head of the marotte. Your attack deals no damage, and the target of your attack must succeed on a DC 13 Wisdom saving throw or become charmed by you for 1 minute. The charmed effect ends the moment you or one of your allies takes hostile actions against the target."
                ],
                [
                    "3",
                    "You and the target of your attack immediately switch places. This is a teleportation effect, which emits an audible pop."
                ],
                [
                    "4",
                    "Magical lightning arcs from the marotte toward the target of your attack. The target takes 2d6 points of lightning damage, and each creature within 10 feet of your target (including you) must succeed on a DC 13 Dexterity saving throw or take 1d6 points of lightning damage."
                ],
                [
                    "5",
                    "The target of your attack is affected by an enlarge/ reduce spell (save DC 13). Roll again. On an even number the target is enlarged, on an odd number they are reduced."
                ],
                [
                    "6",
                    "The marotte transforms into an axe. The attack deals 1d12 + your Charisma modifier slashing damage instead of what it would deal normally. The target of your attack must succeed on a DC 14 Wisdom saving throw or become frightened of you for 1 minute. A frightened creature can attempt a new saving throw at the end of its turn, ending the effect on a success."
                ],
                [
                    "7",
                    "The target of your attack glows the color of your choice. Until the start of your next turn, they shed bright light of out to 15 feet, and dim light an additional 15 feet beyond this."
                ],
                [
                    "8",
                    "You turn invisible for 1 minute. Roll again. On an odd number the target of your attack also becomes invisible for 1 minute."
                ],
                [
                    "9",
                    "Your attack deals no damage.The target of your attack must succeed on a DC 14 Wisdom saving throw or turn into a frog (as the polymorph spell) for 1 minute. Roll again. On a roll of 1, the effect happens again, targeting you."
                ],
                [
                    "10",
                    "Roll twice more on this table, re-rolling 10s. Your attack has both of the effects you rolled combined."
                ]
            ]
        }
    ]
}